ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
            <cluster>
              <name>CH</name>
              <description>Unspecified</description>
              <headerStructName>UICR_IPCT_GLOBAL_CH</headerStructName>
              <access>read-write</access>
              <addressOffset>0x004</addressOffset>
              <register>
                <name>OWN</name>
                <description>Description cluster: Request ownership of the channels of IPCT[n] in Global domain</description>
                <addressOffset>0x000</addressOffset>
                <access>read-write</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>CH_0</name>
                    <description>Channel number</description>
                    <lsb>0</lsb>
                    <msb>0</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 0</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 0</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_1</name>
                    <description>Channel number</description>
                    <lsb>1</lsb>
                    <msb>1</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 1</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 1</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_2</name>
                    <description>Channel number</description>
                    <lsb>2</lsb>
                    <msb>2</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 2</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 2</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_3</name>
                    <description>Channel number</description>
                    <lsb>3</lsb>
                    <msb>3</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 3</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 3</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_4</name>
                    <description>Channel number</description>
                    <lsb>4</lsb>
                    <msb>4</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 4</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 4</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_5</name>
                    <description>Channel number</description>
                    <lsb>5</lsb>
                    <msb>5</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 5</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 5</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_6</name>
                    <description>Channel number</description>
                    <lsb>6</lsb>
                    <msb>6</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 6</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 6</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_7</name>
                    <description>Channel number</description>
                    <lsb>7</lsb>
                    <msb>7</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 7</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 7</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_8</name>
                    <description>Channel number</description>
                    <lsb>8</lsb>
                    <msb>8</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 8</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 8</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_9</name>
                    <description>Channel number</description>
                    <lsb>9</lsb>
                    <msb>9</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 9</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 9</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_10</name>
                    <description>Channel number</description>
                    <lsb>10</lsb>
                    <msb>10</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 10</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 10</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_11</name>
                    <description>Channel number</description>
                    <lsb>11</lsb>
                    <msb>11</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 11</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 11</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_12</name>
                    <description>Channel number</description>
                    <lsb>12</lsb>
                    <msb>12</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 12</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 12</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_13</name>
                    <description>Channel number</description>
                    <lsb>13</lsb>
                    <msb>13</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 13</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 13</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_14</name>
                    <description>Channel number</description>
                    <lsb>14</lsb>
                    <msb>14</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 14</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 14</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_15</name>
                    <description>Channel number</description>
                    <lsb>15</lsb>
                    <msb>15</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 15</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 15</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_16</name>
                    <description>Channel number</description>
                    <lsb>16</lsb>
                    <msb>16</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 16</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 16</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_17</name>
                    <description>Channel number</description>
                    <lsb>17</lsb>
                    <msb>17</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 17</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 17</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_18</name>
                    <description>Channel number</description>
                    <lsb>18</lsb>
                    <msb>18</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 18</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 18</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_19</name>
                    <description>Channel number</description>
                    <lsb>19</lsb>
                    <msb>19</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 19</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 19</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_20</name>
                    <description>Channel number</description>
                    <lsb>20</lsb>
                    <msb>20</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 20</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 20</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_21</name>
                    <description>Channel number</description>
                    <lsb>21</lsb>
                    <msb>21</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 21</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 21</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_22</name>
                    <description>Channel number</description>
                    <lsb>22</lsb>
                    <msb>22</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 22</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 22</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_23</name>
                    <description>Channel number</description>
                    <lsb>23</lsb>
                    <msb>23</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 23</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 23</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_24</name>
                    <description>Channel number</description>
                    <lsb>24</lsb>
                    <msb>24</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 24</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 24</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_25</name>
                    <description>Channel number</description>
                    <lsb>25</lsb>
                    <msb>25</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 25</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 25</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_26</name>
                    <description>Channel number</description>
                    <lsb>26</lsb>
                    <msb>26</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 26</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 26</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_27</name>
                    <description>Channel number</description>
                    <lsb>27</lsb>
                    <msb>27</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 27</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 27</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_28</name>
                    <description>Channel number</description>
                    <lsb>28</lsb>
                    <msb>28</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 28</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 28</description>
                        <value>0x0</value>
                      </enumeratedValue>
                    </enumeratedValues>
                  </field>
                  <field>
                    <name>CH_29</name>
                    <description>Channel number</description>
                    <lsb>29</lsb>
                    <msb>29</msb>
                    <enumeratedValues>
                      <enumeratedValue>
                        <name>NotOwn</name>
                        <description>Do not own the channel 29</description>
                        <value>0x1</value>
                      </enumeratedValue>
                      <enumeratedValue>
                        <name>Own</name>
                        <description>Own the channel 29</description>
                        <value>0x0</value>
                      </enumeratedValue>
