ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
            <register>
              <name>TEMPDETECTORCONFIG</name>
              <description>Unspecified</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TemperatureDetectionStrategy</name>
                  <description>Configure when on-die temperature sensor should check the temperature.</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Periodically</name>
                      <description>On-die temperature sensor is read periodically with selected interval.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>OnServiceCallAndPeriodically</name>
                      <description>On-die temperature sensor is read before each secure service call and periodically with selected interval.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>OnServiceCallOnly</name>
                      <description>On-die temperature sensor is read before each secure service call.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TemperatureDetectionInterval</name>
                  <description>Configure interval for on-die temperature reading if periodic reading is enabled.</description>
                  <lsb>2</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>1Minute</name>
                      <description>On-die temperature sensor is read with one minute intervals.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>15Minutes</name>
                      <description>On-die temperature sensor is read with 15 minutes intervals.</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>1Hour</name>
                      <description>On-die temperature sensor is read with one hour intervals.</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>LowTemperatureThresholdShift</name>
                  <description>Low temperature detection threshold shift in degrees Celsius. The low temperature threshold is calculated by adding the threshold shift to the minimum operating temperature of the SoC.</description>
                  <lsb>4</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>HighTemperatureThresholdShift</name>
                  <description>High temperature detection threshold shift in degrees Celsius. The high temperature threshold is calculated by subtracting the threshold shift from the maximum operating temperature of the SoC.</description>
                  <lsb>12</lsb>
                  <msb>19</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>COUNTERMEASURES</name>
            <description>Configuration of countermeasures.</description>
            <headerStructName>UICR_TAMPER_COUNTERMEASURES</headerStructName>
            <access>read-write</access>
            <addressOffset>0x010</addressOffset>
            <register>
              <name>ENABLE</name>
              <description>Unspecified</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>DPAAES</name>
                  <description>Configure Differential Power Analysis countermeasure for CRACEN AES.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable countermeasure.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable countermeasure.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DPAPK</name>
                  <description>Configure Differential Power Analysis countermeasure for CRACEN PK.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable countermeasure.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable countermeasure.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DPASM4</name>
                  <description>Configure Differential Power Analysis countermeasure for CRACEN SM4.</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable countermeasure.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable countermeasure.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DPAECC</name>
                  <description>Reserved for configuration of Differential Power Analysis countermeasure for CRACEN ECC.</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>DFAAES</name>
                  <description>Reserved for configuration of Differential Fault Analysis countermeasure for CRACEN AES.</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>DFAPK</name>
                  <description>Reserved for configuration of Differential Fault Analysis countermeasure for CRACEN PK.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                </field>
                <field>
                  <name>DFASM4</name>
                  <description>Reserved for configuration of Differential Fault Analysis countermeasure for CRACEN SM4.</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                </field>
                <field>
                  <name>DFAECC</name>
                  <description>Reserved for configuration of Differential Fault Analysis countermeasure for CRACEN ECC.</description>
                  <lsb>7</lsb>
                  <msb>7</msb>
                </field>
                <field>
                  <name>KEYLOAD</name>
                  <description>Configure countermeasure for verifying if cryptography key is loaded correctly into CRACEN.</description>
                  <lsb>8</lsb>
                  <msb>8</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable countermeasure.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable countermeasure.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ClockDithering</name>
                  <description>Configure the clock dithering countermeasure. When enabled clock will be randomly jittered based on TRNG.</description>
                  <lsb>9</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Enable</name>
                      <description>Enable countermeasure.</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Disable</name>
                      <description>Disable countermeasure.</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>INITSVTOR</name>
          <description>Initial value of the secure VTOR (Vector Table Offset Register) after CPU reset.</description>
          <addressOffset>0x780</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INITSVTOR</name>
              <description>Initial value of the VTOR.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>INITNSVTOR</name>
          <description>Initial value of the non-secure VTOR (Vector Table Offset Register).</description>
          <addressOffset>0x784</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>INITNSVTOR</name>
              <description>Initial value of the VTOR.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>WIFICORE</name>
          <description>Unspecified</description>
          <headerStructName>UICR_WIFICORE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x790</addressOffset>
          <register>
            <name>UMACINITPC</name>
            <description>Boot vector for Wi-Fi Core UMAC firmware.</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0xFFFFFFFF</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>UMACINITPC</name>
                <description>Value For UMAC VPR INITPC.</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>PTREXTUICR</name>
          <description>Pointer to extended UICR.</description>
          <addressOffset>0x7FC</addressOffset>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PTREXTUICR</name>
              <description>Pointer to extended UICR.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
