ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
          <cluster>
            <name>BOOT</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_BOOT</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3CC</addressOffset>
            <cluster>
              <name>GPIO</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_BOOT_GPIO</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>PORTCNF</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_BOOT_GPIO_PORTCNF</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <cluster>
                  <name>DRIVECTRL</name>
                  <description>Unspecified</description>
                  <headerStructName>FICR_TRIM_BOOT_GPIO_PORTCNF_DRIVECTRL</headerStructName>
                  <access>read-write</access>
                  <addressOffset>0x000</addressOffset>
                  <register>
                    <dim>0x2</dim>
                    <dimIncrement>0x4</dimIncrement>
                    <name>P[%s]</name>
                    <description>Description collection: Trim value for GPIO.Pn.PORTCNF.DRIVECTRL</description>
                    <addressOffset>0x000</addressOffset>
                    <access>read-only</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <size>0x20</size>
                    <fields>
                      <field>
                        <name>VALUE</name>
                        <description>Trim value</description>
                        <lsb>0</lsb>
                        <msb>31</msb>
                      </field>
                    </fields>
                  </register>
                </cluster>
              </cluster>
            </cluster>
            <cluster>
              <name>VREG1V0</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_BOOT_VREG1V0</headerStructName>
              <access>read-write</access>
              <addressOffset>0x008</addressOffset>
              <register>
                <name>VOUTHPRADIOHELPER</name>
                <description>Config value for SYSCTRL.VREG1V0.VOUTHPRADIO when VREG1V0 used in Helper mode</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Config value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>VOUTHPNOMINAL</name>
                <description>Config value for SYSCTRL.VREG1V0.VOUTHPNOMINAL</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>VALUE</name>
                    <description>Config value</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
            <cluster>
              <name>HSFLL120</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_BOOT_HSFLL120</headerStructName>
              <access>read-write</access>
              <addressOffset>0x010</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_BOOT_HSFLL120_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SYSCTRL.HSFLL120.TRIM.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>COARSE</name>
                  <description>Trim value for SYSCTRL.HSFLL120.TRIM.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>FINE</name>
                  <description>Trim value for SYSCTRL.HSFLL120.TRIM.FINE</description>
                  <addressOffset>0x008</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>TCOEF</name>
                  <description>Trim value for SYSCTRL.HSFLL120.TRIM.TCOEF</description>
                  <addressOffset>0x00C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>OTPC</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_BOOT_OTPC</headerStructName>
              <access>read-write</access>
              <addressOffset>0x020</addressOffset>
              <register>
                <name>WAITSTATES</name>
                <description>Config value for GLOBAL.OTPC.WAITSTATES</description>
                <addressOffset>0x000</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>WAITSTATES</name>
                    <description>Waitstates</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
              <register>
                <name>FREQUENCY</name>
                <description>Config value for GLOBAL.OTPC.FREQUENCY</description>
                <addressOffset>0x004</addressOffset>
                <access>read-only</access>
                <resetValue>0xFFFFFFFF</resetValue>
                <size>0x20</size>
                <fields>
                  <field>
                    <name>FREQUENCY</name>
                    <description>Frequency in MHz</description>
                    <lsb>0</lsb>
                    <msb>31</msb>
                  </field>
                </fields>
              </register>
            </cluster>
          </cluster>
          <cluster>
            <name>COMMON</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_COMMON</headerStructName>
            <access>read-write</access>
            <addressOffset>0x3F4</addressOffset>
            <register>
              <name>FFFF</name>
              <description>Value to be written to multibit MIRROR register in MMIs (MIRROR=1)</description>
              <addressOffset>0x000</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>FFFF</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ZERO</name>
              <description>Value to be written to MIRROR register in MMIs (MIRROR=0)</description>
              <addressOffset>0x004</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ZERO</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>ONE</name>
              <description>Value to be written to MIRROR register in MMIs (MIRROR=1)</description>
              <addressOffset>0x008</addressOffset>
              <access>read-only</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>ONE</name>
                  <description>Mirror register value</description>
                  <lsb>0</lsb>
                  <msb>31</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>SECURE</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_SECURE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x400</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SECURE.HSFLL.TRIM.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL.TRIM.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x6</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL.TRIM.FINE</description>
                  <addressOffset>0x01C</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>HSFLL200</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_HSFLL200</headerStructName>
              <access>read-write</access>
              <addressOffset>0x034</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_HSFLL200_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for SECURE.HSFLL200.TRIM.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>COARSE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL200.TRIM.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <dim>0x4</dim>
                  <dimIncrement>0x4</dimIncrement>
                  <name>FINE[%s]</name>
                  <description>Description collection: Trim value for SECURE.HSFLL200.TRIM.FINE</description>
                  <addressOffset>0x014</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_MEMCONF</headerStructName>
              <access>read-write</access>
              <addressOffset>0x058</addressOffset>
              <cluster>
                <dim>8</dim>
                <dimIncrement>0x004</dimIncrement>
                <name>BLOCKTYPE[%s]</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_MEMCONF_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Description cluster: Trim value for SECURE.MEMCONF.BLOCKTYPE[n].TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>MEMCONF200</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_MEMCONF200</headerStructName>
              <access>read-write</access>
              <addressOffset>0x078</addressOffset>
              <cluster>
                <name>BLOCKTYPE</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_MEMCONF200_BLOCKTYPE</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>TRIM</name>
                  <description>Trim value for SECURE.MEMCONF200.BLOCKTYPE.TRIM</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
            <cluster>
              <name>TCOEFS</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_SECURE_TCOEFS</headerStructName>
              <access>read-write</access>
              <addressOffset>0x07C</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_SECURE_TCOEFS_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>HSFLL</name>
                  <description>Trim value for SECURE.HSFLL.TRIM.TCOEF</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>HSFLL200</name>
                  <description>Trim value for SECURE.HSFLL200.TRIM.TCOEF</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
              </cluster>
            </cluster>
          </cluster>
          <cluster>
            <name>WIFICORE</name>
            <description>Unspecified</description>
            <headerStructName>FICR_TRIM_WIFICORE</headerStructName>
            <access>read-write</access>
            <addressOffset>0x500</addressOffset>
            <cluster>
              <name>HSFLL</name>
              <description>Unspecified</description>
              <headerStructName>FICR_TRIM_WIFICORE_HSFLL</headerStructName>
              <access>read-write</access>
              <addressOffset>0x000</addressOffset>
              <cluster>
                <name>TRIM</name>
                <description>Unspecified</description>
                <headerStructName>FICR_TRIM_WIFICORE_HSFLL_TRIM</headerStructName>
                <access>read-write</access>
                <addressOffset>0x000</addressOffset>
                <register>
                  <name>VSUP</name>
                  <description>Trim value for WIFICORE.HSFLL.TRIM.VSUP</description>
                  <addressOffset>0x000</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>COARSE</name>
                  <description>Trim value for WIFICORE.HSFLL.TRIM.COARSE</description>
                  <addressOffset>0x004</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
                <register>
                  <name>FINE</name>
                  <description>Trim value for WIFICORE.HSFLL.TRIM.FINE</description>
                  <addressOffset>0x008</addressOffset>
                  <access>read-only</access>
                  <resetValue>0xFFFFFFFF</resetValue>
                  <size>0x20</size>
                  <fields>
                    <field>
                      <name>VALUE</name>
                      <description>Trim value</description>
                      <lsb>0</lsb>
                      <msb>31</msb>
                    </field>
                  </fields>
                </register>
