ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CTIINEN[%s]</name>
          <description>Description collection: CTI Trigger to Channel Enable register</description>
          <addressOffset>0x020</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGINEN_0</name>
              <description>Enables a cross trigger event to channel 0 when a ctitrigin input is activated.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Input trigger n events are ignored by channel 0.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When an event is received on input trigger n (ctitrigin[n]), generate an event on channel 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINEN_1</name>
              <description>Enables a cross trigger event to channel 1 when a ctitrigin input is activated.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Input trigger n events are ignored by channel 1.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When an event is received on input trigger n (ctitrigin[n]), generate an event on channel 1.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINEN_2</name>
              <description>Enables a cross trigger event to channel 2 when a ctitrigin input is activated.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Input trigger n events are ignored by channel 2.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When an event is received on input trigger n (ctitrigin[n]), generate an event on channel 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINEN_3</name>
              <description>Enables a cross trigger event to channel 3 when a ctitrigin input is activated.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Input trigger n events are ignored by channel 3.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When an event is received on input trigger n (ctitrigin[n]), generate an event on channel 3.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>0x8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CTIOUTEN[%s]</name>
          <description>Description collection: CTI Channel to Trigger Enable register</description>
          <addressOffset>0x0A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGOUTEN_0</name>
              <description>Enables a cross trigger event to ctitrigout when channel 0 is activated.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Channel 0 is ignored by output trigger n.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When an event occurs on channel 0, generate an event on output event n (ctitrigout[n]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTEN_1</name>
              <description>Enables a cross trigger event to ctitrigout when channel 1 is activated.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Channel 1 is ignored by output trigger n.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When an event occurs on channel 1, generate an event on output event n (ctitrigout[n]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTEN_2</name>
              <description>Enables a cross trigger event to ctitrigout when channel 2 is activated.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Channel 2 is ignored by output trigger n.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When an event occurs on channel 2, generate an event on output event n (ctitrigout[n]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTEN_3</name>
              <description>Enables a cross trigger event to ctitrigout when channel 3 is activated.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Channel 3 is ignored by output trigger n.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>When an event occurs on channel 3, generate an event on output event n (ctitrigout[n]).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTITRIGINSTATUS</name>
          <description>CTI Trigger In Status register Because the register provides a view of the raw ctitrigin inputs, the reset value is UNKNOWN.</description>
          <addressOffset>0x130</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGINSTATUS_0</name>
              <description>Shows the status of ctitrigin0 input.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 0 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 0 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_1</name>
              <description>Shows the status of ctitrigin1 input.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 1 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 1 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_2</name>
              <description>Shows the status of ctitrigin2 input.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 2 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 2 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_3</name>
              <description>Shows the status of ctitrigin3 input.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 3 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 3 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_4</name>
              <description>Shows the status of ctitrigin4 input.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 4 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 4 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_5</name>
              <description>Shows the status of ctitrigin5 input.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 5 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 5 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_6</name>
              <description>Shows the status of ctitrigin6 input.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 6 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 6 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGINSTATUS_7</name>
              <description>Shows the status of ctitrigin7 input.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigin 7 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigin 7 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTITRIGOUTSTATUS</name>
          <description>CTI Trigger Out Status register</description>
          <addressOffset>0x134</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGOUTSTATUS_0</name>
              <description>Shows the status of ctitrigout0 output.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 0 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 0 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_1</name>
              <description>Shows the status of ctitrigout1 output.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 1 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 1 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_2</name>
              <description>Shows the status of ctitrigout2 output.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 2 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 2 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_3</name>
              <description>Shows the status of ctitrigout3 output.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 3 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 3 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_4</name>
              <description>Shows the status of ctitrigout4 output.</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 4 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 4 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_5</name>
              <description>Shows the status of ctitrigout5 output.</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 5 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 5 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_6</name>
              <description>Shows the status of ctitrigout6 output.</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 6 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 6 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGOUTSTATUS_7</name>
              <description>Shows the status of ctitrigout7 output.</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctitrigout 7 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctitrigout 7 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTICHINSTATUS</name>
          <description>CTI Channel In Status register Because the register provides a view of the raw ctichin inputs, the reset value is UNKNOWN.</description>
          <addressOffset>0x138</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTICHINSTATUS_0</name>
              <description>Shows the status of the ctitrigin 0 input.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichin 0 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichin 0 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHINSTATUS_1</name>
              <description>Shows the status of the ctitrigin 1 input.</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichin 1 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichin 1 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHINSTATUS_2</name>
              <description>Shows the status of the ctitrigin 2 input.</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichin 2 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichin 2 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTICHINSTATUS_3</name>
              <description>Shows the status of the ctitrigin 3 input.</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Active</name>
                  <description>Ctichin 3 is active.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Inactive</name>
                  <description>Ctichin 3 is inactive.</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
