ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Real Time Choke is disabled for master port 28 Read Address Channel</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Real Time Choke is enabled for master port 28 Read Address Channel</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLE_29</name>
                <description>Enable Real Time Choke for Read Address Channel</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Real Time Choke is disabled for master port 29 Read Address Channel</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Real Time Choke is enabled for master port 29 Read Address Channel</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLE_30</name>
                <description>Enable Real Time Choke for Read Address Channel</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Real Time Choke is disabled for master port 30 Read Address Channel</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Real Time Choke is enabled for master port 30 Read Address Channel</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLE_31</name>
                <description>Enable Real Time Choke for Read Address Channel</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disable</name>
                    <description>Real Time Choke is disabled for master port 31 Read Address Channel</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enable</name>
                    <description>Real Time Choke is enabled for master port 31 Read Address Channel</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x20</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>DELAY[%s]</name>
            <description>Description collection: Real Time Choke delay value for slave number n</description>
            <addressOffset>0x60</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DELAY</name>
                <description>Real Time Choke delay in bus clock cycles.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>32</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>REGION[%s]</name>
          <description>Memory region to slave decoding table</description>
          <headerStructName>MPC_REGION</headerStructName>
          <access>read-write</access>
          <addressOffset>0x600</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>Description cluster: Slave region n Configuration register</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SLAVENUMBER</name>
                <description>Target slave number for region n accesses. Slave number 0 is reserved for default slave</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LOCK</name>
                <description>Locks the region n setting</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-writeonce</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Unlocked</name>
                    <description>Region n settings can be updated</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Locked</name>
                    <description>Region n settings can't be updated until next reset</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENABLE</name>
                <description>Region n enable</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Region n is not used</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Region n is used</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>READ</name>
                <description>Read access</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Read access to region n is not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Read access to region n is allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>WRITE</name>
                <description>Write access</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Write access to region n is not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Write access to region n is allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EXECUTE</name>
                <description>Software execute</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Software execution from region n is not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allowed</name>
                    <description>Software execution from region n is allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SECATTR</name>
                <description>Memory security mapping</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Secure</name>
                    <description>Memory is mapped in secure memory address space</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NonSecure</name>
                    <description>Memory is mapped in non-secure memory address space</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>OWNERID</name>
                <description>Region owner identifier.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>STARTADDR</name>
            <description>Description cluster: Region n start address</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>STARTADDR</name>
                <description>Start address for memory region n</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>ADDRMASK</name>
            <description>Description cluster: Select which bits of the incoming address are compared against the STARTADDR</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ADDRMASK</name>
                <description>Address mask for memory region n</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
