ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <register>
          <name>DATAWHITEIV</name>
          <description>Data whitening initial value</description>
          <addressOffset>0x540</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DATAWHITEIV</name>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>ACQINJ</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_ACQINJ</headerStructName>
          <access>read-write</access>
          <addressOffset>0x548</addressOffset>
          <register>
            <dim>0x2</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>CNF[%s]</name>
            <description>Description collection: Data acquisition/injection configuration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACQMODE</name>
                <description>Acquisition mode (data from peripheral written to memory)</description>
                <lsb>0</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AdcIQ</name>
                    <description>ADC IQ</description>
                    <value>0x00</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AdcIQAndAgcGain</name>
                    <description>ADC IQ; AGC settings</description>
                    <value>0x02</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AgcGainAndPkd</name>
                    <description>AGC settings; peak detects; IF and baseband signal magnitudes</description>
                    <value>0x04</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FeIQ</name>
                    <description>Frontend IQ after decimation, downmix and filtering</description>
                    <value>0x06</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Rtt</name>
                    <description>Baseband Channel Sounding RTT Data</description>
                    <value>0x07</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BbIQ</name>
                    <description>Baseband IQ after frequency offset compensation</description>
                    <value>0x08</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BbAaIQ</name>
                    <description>Baseband IQ after frequency offset compensation (both Hyper and AA demodulator)</description>
                    <value>0x09</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StdBits</name>
                    <description>Valid serial data from Standard Demodulator</description>
                    <value>0x0A</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>HypBits</name>
                    <description>Valid serial data from Hyper Demodulator</description>
                    <value>0x0C</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AaBits</name>
                    <description>Valid serial data from AA Demodulator</description>
                    <value>0x0D</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StdHypBitsMux</name>
                    <description>Serial data+valid muxed stream Hyper and Standard demodulators</description>
                    <value>0x0E</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>StdHypAaBitsMux</name>
                    <description>Serial data+valid muxed stream Hyper, Standard and AA demodulators</description>
                    <value>0x0F</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FeDecIQ</name>
                    <description>Frontend IQ after decimation</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FeMixIQ</name>
                    <description>Frontend IQ after decimation and downmix</description>
                    <value>0x12</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AdPllTrace</name>
                    <description>ADPLL tracing</description>
                    <value>0x14</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>INJMODE</name>
                <description>Injection mode (data from memory pushed to peripheral)</description>
                <lsb>8</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>OvrAdcIQ</name>
                    <description>Override ADC IQ</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OvrFeMixIQ</name>
                    <description>Override Frontend IQ after decimation and downmix</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>OvrFeDecIQ</name>
                    <description>Override Frontend IQ after decimation</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AdPllMod</name>
                    <description>ADPLL custom modulation source</description>
                    <value>0xA</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RATEDIV</name>
                <description>Decrease write rate of acqusition or read rate of injection Zero gives native rate of the selected ACQMODE/INJMODE. Every increment by 1 will halve the rate.</description>
                <lsb>16</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>CYCLIC</name>
                <description>The END event of DMA automatically triggers the START event so that it continuously will store/read data</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>DIR</name>
                <description>Data acquisition or injection</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Acq</name>
                    <description>Peripheral to memory</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Inj</name>
                    <description>Memory to peripheral</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <dim>2</dim>
          <dimIncrement>0x010</dimIncrement>
          <name>ACQINJDMA[%s]</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_ACQINJDMA</headerStructName>
          <access>read-write</access>
          <addressOffset>0x550</addressOffset>
          <register>
            <name>ENABLE</name>
            <description>Description cluster: Enable or disable data acquisition</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>Enable or disable data acquisition</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Data acquisition is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Data acquisition is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PTR</name>
            <description>Description cluster: ACQ DMA pointer</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OFFSET</name>
                <lsb>0</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BASE</name>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MAXCNT</name>
            <description>Description cluster: Maximum number of 32-bit words to transfer</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000040</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MAXCNT</name>
                <description>Maximum number of 32-bit words to transfer</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>AMOUNT</name>
            <description>Description cluster: Number of 32-bit words transferred in the last transaction</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AMOUNT</name>
                <description>Number of 32-bit words transferred in the last transaction</description>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>TESTINTERFACE</name>
          <description>2.4 GHz radio direct test interface</description>
          <headerStructName>RADIO_TESTINTERFACE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x570</addressOffset>
          <register>
            <name>LOCK</name>
            <description>Security LOCK for test interface</description>
            <addressOffset>0x000</addressOffset>
            <access>read-writeonce</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LOCK</name>
                <description>Write once to permanently lock or unlock.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Lock</name>
                    <description>Interface is locked and cannot be enabled.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Unlock</name>
                    <description>Interface is unlocked and can be enabled.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>CONF</name>
            <description>CONFIG for PSEL test interface</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXDATASOURCE</name>
                <description>Source select for Rx data GPIO output and Rx clock output. Can optionally output Tx data that is transmitted and TX clock</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Standard</name>
                    <description>Data and clock source is from standard demodulator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Hyper</name>
                    <description>Data and clock source is from hyper demodulator</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FelisTx</name>
                    <description>Data source is Tx data to SphynxSupport.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MacTx</name>
                    <description>Data source is Tx data to FelisTx.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TXDATASINK</name>
                <description>Sink select for Tx Data input. TX clock source is always SphynxSupport</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>FelisTx</name>
                    <description>TX data sink is FelisTx</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SphynxSupport</name>
                    <description>TX data sink is SphynxSupport</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <cluster>
            <name>DEBUGPSEL</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_TESTINTERFACE_DEBUGPSEL</headerStructName>
            <access>read-write</access>
            <addressOffset>0x008</addressOffset>
            <register>
              <name>IRQ</name>
              <description>Pin select for RADIO irq</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PIN</name>
                  <description>Pin number</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>PORT</name>
                  <description>Port number</description>
                  <lsb>5</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>CONNECT</name>
                  <description>Connection</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disconnected</name>
                      <description>Disconnect</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Connected</name>
                      <description>Connect</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RXCLK</name>
              <description>Pin select for RXCLK</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PIN</name>
                  <description>Pin number</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>PORT</name>
                  <description>Port number</description>
                  <lsb>5</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>CONNECT</name>
                  <description>Connection</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disconnected</name>
                      <description>Disconnect</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Connected</name>
                      <description>Connect</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>RXDATA</name>
              <description>Pin select for RXDATA</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PIN</name>
                  <description>Pin number</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>PORT</name>
                  <description>Port number</description>
                  <lsb>5</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>CONNECT</name>
                  <description>Connection</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disconnected</name>
                      <description>Disconnect</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Connected</name>
                      <description>Connect</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TXCLK</name>
              <description>Pin select for RADIO clock (direct mode, base band debug. txCk and ckDataIn signals)</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PIN</name>
                  <description>Pin number</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>PORT</name>
                  <description>Port number</description>
                  <lsb>5</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>CONNECT</name>
                  <description>Connection</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disconnected</name>
                      <description>Disconnect</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Connected</name>
                      <description>Connect</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>TXDATA</name>
              <description>Pin select for RADIO data (direct mode, base band debug. txRadioData and dataIn signals)</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0xFFFFFFFF</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>PIN</name>
                  <description>Pin number</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                </field>
                <field>
                  <name>PORT</name>
                  <description>Port number</description>
                  <lsb>5</lsb>
                  <msb>8</msb>
                </field>
                <field>
                  <name>CONNECT</name>
                  <description>Connection</description>
                  <lsb>31</lsb>
                  <msb>31</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>Disconnected</name>
                      <description>Disconnect</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>Connected</name>
                      <description>Connect</description>
                      <value>0x0</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
        <register>
          <name>GAINOUT</name>
          <description>Gain readout (LNA_OUT_SPI for nrf52/53)</description>
          <addressOffset>0x5A0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LNAGAIN</name>
              <lsb>0</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>MIXGAIN</name>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>AAFGAIN</name>
              <lsb>12</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
