ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <register>
          <name>SOFTRESETLEVEL</name>
          <description>Configure what level of reset is caused by TASKS_SOFTRESET in each of the submodules. At level 0, FSMs and public registers (including non-public fields) are reset. At level 1, also non-public registers are reset.</description>
          <addressOffset>0x5E0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODEM</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>RADIOANA</name>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>ADPLLCOMP</name>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>RXFE</name>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>RXBB</name>
              <lsb>4</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>TX</name>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>DFE</name>
              <lsb>6</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>MAC</name>
              <lsb>7</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>LBMAC</name>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>AHBMASTERS</name>
          <description>For setting priorities among RADIO/CRYPTO AHB masters if interfaced with Nordic's AMBA Interconnect IP</description>
          <headerStructName>RADIO_AHBMASTERS</headerStructName>
          <access>read-write</access>
          <addressOffset>0x5F0</addressOffset>
          <register>
            <name>PRIORITY</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RADIO</name>
                <description>Priority level for AHB master RADIO</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Lowest Priority Level</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>Highest Priority Level</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RADIODFE</name>
                <description>Priority level for AHB master RADIODFE</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Lowest Priority Level</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>Highest Priority Level</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RADIOACQINJ0</name>
                <description>Priority level for AHB master RADIOACQINJ0</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Lowest Priority Level</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>Highest Priority Level</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>RADIOACQINJ1</name>
                <description>Priority level for AHB master RADIOACQINJ1</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Lowest Priority Level</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>Highest Priority Level</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRYPTOGATHER</name>
                <description>Priority level for AHB master CRYPTOGATHER</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Lowest Priority Level</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>Highest Priority Level</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRYPTOSCATTER</name>
                <description>Priority level for AHB master CRYPTOSCATTER</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Low</name>
                    <description>Lowest Priority Level</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>High</name>
                    <description>Highest Priority Level</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>SHORTCUTANA</name>
          <description>Internal shortcuts for RADIO PHY</description>
          <addressOffset>0x700</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXREADYCALSTART</name>
              <description>Internal shortcut</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>RXREADYCALSTART</name>
              <description>Internal shortcut</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>LBREADYCALSTART</name>
              <description>Internal shortcut</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>CALDONEDISABLE</name>
              <description>Internal shortcut</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMING</name>
          <description>Timing</description>
          <addressOffset>0x704</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RU</name>
              <description>0: Legacy ramp-up time, compatible with 180nm radio. 1: Default fast ramp-up.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCY</name>
          <description>Frequency</description>
          <addressOffset>0x708</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQUENCY</name>
              <description>Radio channel frequency. Frequency = 2400 + FREQUENCY (MHz).</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>MAP</name>
              <description>Channel map selection. 0: Channel map between 2400 MHZ to 2500 MHz, Frequency = 2400 + FREQUENCY (MHz). 1: Channel map between 2360 MHZ to 2460 MHz, Frequency = 2360 + FREQUENCY (MHz).</description>
              <lsb>8</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQUENCYCONFIG</name>
          <description>Configuration of frequency control</description>
          <addressOffset>0x70C</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSCHNOINCRSTEP</name>
              <description>Radio channel incremental step unit</description>
              <lsb>0</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>BUFFEREDFSCH</name>
              <description>Set to high to buffer FREQUENCY register so that sub-modules in the MMI will only update next frequency config at TX_EN, RX_EN and LB_EN. Set to low if special test is needed for FS test.</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPOWER</name>
          <description>Output power</description>
          <addressOffset>0x710</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000000E</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXPOWER</name>
              <description>RADIO output power</description>
              <lsb>0</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Pos10dBm</name>
                  <description>+10 dBm</description>
                  <value>0x01F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos9dBm</name>
                  <description>+9 dBm</description>
                  <value>0x01D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos8dBm</name>
                  <description>+8 dBm</description>
                  <value>0x01C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos7dBm</name>
                  <description>+7 dBm</description>
                  <value>0x01B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos6dBm</name>
                  <description>+6 dBm</description>
                  <value>0x01A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos5dBm</name>
                  <description>+5 dBm</description>
                  <value>0x019</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos4dBm</name>
                  <description>+4 dBm</description>
                  <value>0x018</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos3dBm</name>
                  <description>+3 dBm</description>
                  <value>0x017</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos2dBm</name>
                  <description>+2 dBm</description>
                  <value>0x016</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pos1dBm</name>
                  <description>+1 dBm</description>
                  <value>0x00F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0dBm</name>
                  <description>0 dBm</description>
                  <value>0x00E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg1dBm</name>
                  <description>-1 dBm</description>
                  <value>0x00D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg2dBm</name>
                  <description>-2 dBm</description>
                  <value>0x00C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg4dBm</name>
                  <description>-4 dBm</description>
                  <value>0x00B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg8dBm</name>
                  <description>-8 dBm</description>
                  <value>0x00A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg12dBm</name>
                  <description>-12 dBm</description>
                  <value>0x009</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg16dBm</name>
                  <description>-16 dBm</description>
                  <value>0x008</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg20dBm</name>
                  <description>-20 dBm</description>
                  <value>0x003</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg30dBm</name>
                  <description>-30 dBm</description>
                  <value>0x002</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg40dBm</name>
                  <description>-40 dBm</description>
                  <value>0x001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Neg70dBm</name>
                  <description>-70 dBm</description>
                  <value>0x000</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFS</name>
          <description>Interframe spacing in us</description>
          <addressOffset>0x714</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TIFS</name>
              <description>Interframe spacing in us. Interframe space is the time interval between two consecutive packets. It is defined as the time, in microseconds, from the end of the last bit of the previous packet to the start of the first bit of the subsequent packet.</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSISAMPLE</name>
          <description>RSSI sample</description>
          <addressOffset>0x718</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000007F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>RSSISAMPLE</name>
              <description>RSSI sample result. The value of this register is read as a positive value while the actual received signal strength is a negative value. Actual received signal strength is therefore as follows: received signal strength = -A dBm.</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTCONFIG</name>
          <description>Event configuration</description>
          <addressOffset>0x71C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TTXDISABLE</name>
              <description>Transition time from TXDISABLE state to DISABLED state Configurable time, in us, between RADIO.EVENTS_END and RADIO.EVENTS_DISABLED when using the shortcut between RADIO.EVENTS_END and RADIO.TASKS_DISABLE. The minimum time between RADIO.TASKS_DISABLE and RADIO.EVENTS_DISABLED is described in the electrical parameters. The minimum time will be used if the configured time is set shorter than the minimum time. Depending on configuration setting the DISABLED event may experience some jitter, see electrical parameters for more information. Note: The RADIO shall be disabled as normal when DISABLE task is triggered, it is only the DISABLED event that can be delayed. Note: The TIFS mechanism shall not be affected by the value specified in this field. (unit: 1us)</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>TRXDISABLE</name>
              <description>Transition time from RXDISABLE state to DISABLED state Configurable time, in us, between RADIO.EVENTS_END and RADIO.EVENTS_DISABLED when using the shortcut between RADIO.EVENTS_END and RADIO.TASKS_DISABLE. The minimum time between RADIO.TASKS_DISABLE and RADIO.EVENTS_DISABLED is described in electrical parameters. The minimum time will be used if the configured time is set shorter than the minimum time. Depending on configuration setting the DISABLED event may experience some jitter, see electrical parameters for more information. (unit: 1us)</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>CALIBRATION</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_CALIBRATION</headerStructName>
          <access>read-write</access>
          <addressOffset>0x720</addressOffset>
          <register>
            <name>TARGET</name>
            <description>Select target for calibration</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CALTARGET</name>
                <description>Calibration target selection for calibration engine, 0: DC_CAL, 1: RC_CAL</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DCCONFIG</name>
            <description>Calibration config when CALTARGET=DC_CAL</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x74021F0D</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CALTSTART</name>
                <description>Startup wait time (default 437.5ns)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>CALTSETTLE</name>
                <description>Settle wait time (default 1000ns)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CALTCOMPARE</name>
                <description>Compare wait time (default 93.75ns)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CALMSB</name>
                <description>Index of most significant bit to be calibrated (add 1 to get number of bits)</description>
                <lsb>24</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>CALINVERTCMPI</name>
                <description>1: invert calCmp1 (I) before it goes into calibration engine #1</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>CALINVERTCMPQ</name>
                <description>1: invert calCmp2 (Q) before it goes into calibration engine #2</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>CALCODEFORMAT</name>
                <description>0: 2's complement, 1: sign-magnitude</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RCCONFIG</name>
            <description>Calibration config when CALTARGET=RC_CAL</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x03165204</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CALTSTART</name>
                <description>Startup wait time (default 156.25ns)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>CALTSETTLE</name>
                <description>Settle wait time (default 2593.75ns)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>CALTCOMPARE</name>
                <description>Compare wait time (default 718.75ns)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>CALMSB</name>
                <description>Index of most significant bit to be calibrated (add 1 to get number of bits)</description>
                <lsb>24</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>CALINVERTCMP</name>
                <description>1: invert calCmp1 before it goes into calibration engine #1</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
            </fields>
          </register>
