ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <cluster>
          <name>TIMINGENGINE</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_TIMINGENGINE</headerStructName>
          <access>read-write</access>
          <addressOffset>0x770</addressOffset>
          <register>
            <name>TIMINGALL0</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x010000A0</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPLLSETTLED</name>
                <description>Timing control of pllSettled (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TRETAINRADIO</name>
                <description>Timing control of retainRadio (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPRADIOBIT0</name>
                <description>Timing control of pwrupRadio[0] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPRADIOBIT1</name>
                <description>Timing control of pwrupRadio[1] (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGALL1</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00150301</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPFSREFBIT0</name>
                <description>Timing control of PwrupFsRef[0] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPFSREFBIT1</name>
                <description>Timing control of PwrupFsRef[1] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPFSREFBIT2</name>
                <description>Timing control of PwrupFsRef[2] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGALL2</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x38182120</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRSTFSLSBIT0</name>
                <description>Timing control of RstFsLs[0] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TRSTFSLSBIT1</name>
                <description>Timing control of RstFsLs[1] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPFSLDOVCOBIT0</name>
                <description>Timing control of PwrupFsLdoVco[0] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPFSLDOVCOBIT1</name>
                <description>Timing control of PwrupFsLdoVco[1] (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGALL3</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-write</access>
            <resetValue>0x30181C18</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPFSLDODTCBIT0</name>
                <description>Timing control of PwrupFsLdoDtc[0] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPFSLDODTCBIT1</name>
                <description>Timing control of PwrupFsLdoDtc[1] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPFSLDODIGBIT0</name>
                <description>Timing control of PwrupFsLdoDig[0] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPFSLDODIGBIT1</name>
                <description>Timing control of PwrupFsLdoDig[1] (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGALL4</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x010</addressOffset>
            <access>read-write</access>
            <resetValue>0x2420201C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPFSLDODIVBIT0</name>
                <description>Timing control of PwrupFsLdoDiv[0] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPFSLDODIVBIT1</name>
                <description>Timing control of PwrupFsLdoDiv[1] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPFSLDOCNTBIT0</name>
                <description>Timing control of PwrupFsLdoCnt[0] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPFSLDOCNTBIT1</name>
                <description>Timing control of PwrupFsLdoCnt[1] (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGALL5</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x014</addressOffset>
            <access>read-write</access>
            <resetValue>0x30242420</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPFSLDOTDCBIT0</name>
                <description>Timing control of PwrupFsLdoTdc[0] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPFSLDOTDCBIT1</name>
                <description>Timing control of PwrupFsLdoTdc[1] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TARSTFS</name>
                <description>Timing control of ArstFs (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TFSSTART</name>
                <description>Timing control of FsStart (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGALL6</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x018</addressOffset>
            <access>read-write</access>
            <resetValue>0x1E1A221A</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPFSDTC</name>
                <description>Timing control of PwrupFsDtc (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPFSTDC</name>
                <description>Timing control of PwrupFsTdc (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPFSVCO</name>
                <description>Timing control of PwrupFsVco (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPFSDIV2</name>
                <description>Timing control of PwrupFsDiv2 (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGALL7</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-write</access>
            <resetValue>0x2D210120</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPFSDIV2G4COUNTER</name>
                <description>Timing control of PwrupFsDiv2g4Counter (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPRXTXREFBIT0</name>
                <description>Timing control of PwrupRxTxRef[0] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPRXTXREFBIT1</name>
                <description>Timing control of PwrupRxTxRef[1] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPRXTXREFBIT2</name>
                <description>Timing control of PwrupRxTxRef[2] (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGALL8</name>
            <description>Timing parameters for signals activated in both Rx and Tx mode</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000028</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRSTFSLSBIT2</name>
                <description>Timing control of RstFsLs[2] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MODEDEPENDENT</name>
            <description>Mode dependent timing parameters</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x18100010</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TIFSDELTA</name>
                <description>Timing control of IfsDelta (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TIFSDELTAPLUS</name>
                <description>Timing control of IfsDeltaPlus (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>TDELTAPIPE</name>
                <description>Timing control of DeltaPipe (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TDELTAPWRDNPA</name>
                <description>Timing control of DeltaPwrdnPa (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGRX0</name>
            <description>Timing parameters for signals activated in Rx mode</description>
            <addressOffset>0x028</addressOffset>
            <access>read-write</access>
            <resetValue>0x6C646D6C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRSTRXLSBIT0</name>
                <description>Timing control of RstRxLs[0] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TRSTRXLSBIT1</name>
                <description>Timing control of RstRxLs[1] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPRXLDOBIT0</name>
                <description>Timing control of PwrupRxLdo[0] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPRXLDOBIT1</name>
                <description>Timing control of PwrupRxLdo[1] (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGRX1</name>
            <description>Timing parameters for signals activated in Rx mode</description>
            <addressOffset>0x02C</addressOffset>
            <access>read-write</access>
            <resetValue>0x6C646C64</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPRXLDOBIT2</name>
                <description>Timing control of PwrupRxLdo[2] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPRXLDOBIT3</name>
                <description>Timing control of PwrupRxLdo[3] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPRXLDOBIT4</name>
                <description>Timing control of PwrupRxLdo[4] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPRXLDOBIT5</name>
                <description>Timing control of PwrupRxLdo[5] (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGRX2</name>
            <description>Timing parameters for signals activated in Rx mode</description>
            <addressOffset>0x030</addressOffset>
            <access>read-write</access>
            <resetValue>0x68686868</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPRXLNA</name>
                <description>Timing control of PwrupRxLna (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPRXMIX</name>
                <description>Timing control of PwrupRxMix (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPRX</name>
                <description>Timing control of PwrupRx (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPRXAAF</name>
                <description>Timing control of PwrupRxAaf (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGRX3</name>
            <description>Timing parameters for signals activated in Rx mode</description>
            <addressOffset>0x034</addressOffset>
            <access>read-write</access>
            <resetValue>0x00786868</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPRXSARBIT0</name>
                <description>Timing control of PwrupRxSar[0] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPRXSARBIT1</name>
                <description>Timing control of PwrupRxSar[1] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPRXPKD</name>
                <description>Spare register. Power up peak detector is now tied with power up mixer.</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGRX4</name>
            <description>Timing parameters for signals activated in Rx mode</description>
            <addressOffset>0x038</addressOffset>
            <access>read-write</access>
            <resetValue>0x78787468</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TARSTADC</name>
                <description>Timing control of ArstAdc (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TARSTADCEND</name>
                <description>Timing control of ArstAdcEnd (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TRXAGCEN</name>
                <description>Timing control of RxAgcEn (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TRXDIGEN</name>
                <description>Timing control of RxDigEn (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGTX0</name>
            <description>Timing parameters for signals activated in Tx mode</description>
            <addressOffset>0x03C</addressOffset>
            <access>read-write</access>
            <resetValue>0x806C7C74</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPTXLDOBIT0</name>
                <description>Timing control of PwrupTxLdo[0] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPTXLDOBIT1</name>
                <description>Timing control of PwrupTxLdo[1] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPTXLDOBIT2</name>
                <description>Timing control of PwrupTxLdo[2] (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPTXLDOBIT3</name>
                <description>Timing control of PwrupTxLdo[3] (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGTX1</name>
            <description>Timing parameters for signals activated in Tx mode</description>
            <addressOffset>0x040</addressOffset>
            <access>read-write</access>
            <resetValue>0x7870806C</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPTXLDOBIT4</name>
                <description>Timing control of PwrupTxLdo[4] (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TPWRUPTXLDOBIT5</name>
                <description>Timing control of PwrupTxLdo[5] (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TPWRUPTX</name>
                <description>Timing control of PwrupTx (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>TPWRUPTXPWRCTRL</name>
                <description>Timing control of PwrupTxPwrCtrl (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>TIMINGTX2</name>
            <description>Timing parameters for signals activated in Tx mode</description>
            <addressOffset>0x044</addressOffset>
            <access>read-write</access>
            <resetValue>0x00060078</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TPWRUPTXPA</name>
                <description>Timing control of PwrupTxPa (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TDELTAPIPE</name>
                <description>Timing control of DeltaPipe (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>TDELTAPWRDNPA</name>
                <description>Timing control of DeltaPwrdnPa (unit: 0.25us)</description>
                <lsb>16</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
