ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
          <register>
            <name>CONFIG</name>
            <description>Configuration of timing control</description>
            <addressOffset>0x048</addressOffset>
            <access>read-write</access>
            <resetValue>0x06020464</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TREDUCETRXSWITCH</name>
                <description>Reduced timing for on-the-fly switch on both Rx-&amp;gt;Tx and Tx-&amp;gt;Rx (unit: 0.25us)</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>TRXTXTURNAROUNDHOLD</name>
                <description>Additional delay to hold Tx/Rx turnaround (unit: 0.25us)</description>
                <lsb>8</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>TREDUCETRXSWITCHEXTRA</name>
                <description>Extra reduced timing for on-the-fly Tx-&amp;gt;Rx (select signals) (unit: 0.25us)</description>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OVRENALL</name>
            <description>Enable or disable override of signals</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OVRENRETAINRADIO</name>
                <description>Override enable of RetainRadio</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>OVRENPWRUPRADIO</name>
                <description>Override enable of PwrupRadio</description>
                <lsb>1</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSREF</name>
                <description>Override enable of PwrupFsRef</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>OVRENRSTFSLS</name>
                <description>Override enable of RstFsLs</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSLDOVCO</name>
                <description>Override enable of PwrupFsLdoVco</description>
                <lsb>9</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSLDODTC</name>
                <description>Override enable of PwrupFsLdoDtc</description>
                <lsb>11</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSLDODIG</name>
                <description>Override enable of PwrupFsLdoDig</description>
                <lsb>13</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSLDODIV</name>
                <description>Override enable of PwrupFsLdoDiv</description>
                <lsb>15</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSLDOCNT</name>
                <description>Override enable of PwrupFsLdoCnt</description>
                <lsb>17</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSLDOTDC</name>
                <description>Override enable of PwrupFsLdoTdc</description>
                <lsb>19</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSDTC</name>
                <description>Override enable of PwrupFsDtc</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSTDC</name>
                <description>Override enable of PwrupFsTdc</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSVCO</name>
                <description>Override enable of PwrupFsVco</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSDIV2</name>
                <description>Override enable of PwrupFsDiv2</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>OVRENPWRUPFSDIV2G4COUNTER</name>
                <description>Override enable of PwrupFsDiv2g4Counter</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>OVRENARSTFS</name>
                <description>Override enable of ArstFs</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>OVRENFSSTART</name>
                <description>Override enable of FsStart</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>OVRENPWRUPRXTXREF</name>
                <description>Override enable of PwrupRxTxRef</description>
                <lsb>28</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OVRENRXTX</name>
            <description>Enable or disable override of signals</description>
            <addressOffset>0x050</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OVRENRSTRXLS</name>
                <description>Override enable of RstRxLs</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>OVRENPWRUPRXLDO</name>
                <description>Override enable of PwrupRxLdo</description>
                <lsb>2</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OVRENPWRUPRXLNA</name>
                <description>Override enable of PwrupRxLna</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>OVRENPWRUPRXMIX</name>
                <description>Override enable of PwrupRxMix</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>OVRENPWRUPRX</name>
                <description>Override enable of PwrupRx</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>OVRENPWRUPRXAAF</name>
                <description>Override enable of PwrupRxAaf</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OVRENPWRUPRXSAR</name>
                <description>Override enable of PwrupRxSar</description>
                <lsb>12</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>OVRENPWRUPRXPKD</name>
                <description>Override enable of PwrupRxPkd</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>OVRENARSTADC</name>
                <description>Override enable of ArstAdc</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>OVRENPWRUPTXLDO</name>
                <description>Override enable of PwrupTxLdo</description>
                <lsb>16</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>OVRENPWRUPTX</name>
                <description>Override enable of PwrupTx</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>OVRENPWRUPTXPWRCTRL</name>
                <description>Override enable of PwrupTxPwrCtrl</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>OVRENPWRUPTXPA</name>
                <description>Override enable of PwrupTxPa</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>OVRENPWRUPEXTLNA</name>
                <description>Override enable of PwrupExtLna</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>OVRENPWRUPEXTPA</name>
                <description>Override enable of PwrupExtPa</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>OVRENSETRXIF</name>
                <description>Override enable of setRxIf</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>OVRENRXAGCEN</name>
                <description>Override enable of rxAgcEn</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>OVRENRXDIGEN</name>
                <description>Override enable of rxDigEn</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>OVRENPWRUPRXLNAPDET</name>
                <description>Override enable of PwrupRxLnaPdet</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OVRVALALL</name>
            <description>Set override values on signals</description>
            <addressOffset>0x054</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OVRVALRETAINRADIO</name>
                <description>Override value of RetainRadio</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRADIO</name>
                <description>Override value of PwrupRadio</description>
                <lsb>1</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSREF</name>
                <description>Override value of PwrupFsRef</description>
                <lsb>3</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>OVRVALRSTFSLS</name>
                <description>Override value of RstFsLs</description>
                <lsb>6</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSLDOVCO</name>
                <description>Override value of PwrupFsLdoVco</description>
                <lsb>9</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSLDODTC</name>
                <description>Override value of PwrupFsLdoDtc</description>
                <lsb>11</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSLDODIG</name>
                <description>Override value of PwrupFsLdoDig</description>
                <lsb>13</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSLDODIV</name>
                <description>Override value of PwrupFsLdoDiv</description>
                <lsb>15</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSLDOCNT</name>
                <description>Override value of PwrupFsLdoCnt</description>
                <lsb>17</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSLDOTDC</name>
                <description>Override value of PwrupFsLdoTdc</description>
                <lsb>19</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSDTC</name>
                <description>Override value of PwrupFsDtc</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSTDC</name>
                <description>Override value of PwrupFsTdc</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSVCO</name>
                <description>Override value of PwrupFsVco</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSDIV2</name>
                <description>Override value of PwrupFsDiv2</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>OVRVALPWRUPFSDIV2G4COUNTER</name>
                <description>Override value of PwrupFsDiv2g4Counter</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>OVRVALARSTFS</name>
                <description>Override value of ArstFs</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>OVRVALFSSTART</name>
                <description>Override value of FsStart</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRXTXREF</name>
                <description>Override value of PwrupRxTxRef</description>
                <lsb>28</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>OVRVALRXTX</name>
            <description>Set override values on signals</description>
            <addressOffset>0x058</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>OVRVALRSTRXLS</name>
                <description>Override value of RstRxLs</description>
                <lsb>0</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRXLDO</name>
                <description>Override value of PwrupRxLdo</description>
                <lsb>2</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRXLNA</name>
                <description>Override value of PwrupRxLna</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRXMIX</name>
                <description>Override value of PwrupRxMix</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRX</name>
                <description>Override value of PwrupRx</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRXAAF</name>
                <description>Override value of PwrupRxAaf</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRXSAR</name>
                <description>Override value of PwrupRxSar</description>
                <lsb>12</lsb>
                <msb>13</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRXPKD</name>
                <description>Override value of PwrupRxPkd</description>
                <lsb>14</lsb>
                <msb>14</msb>
              </field>
              <field>
                <name>OVRVALARSTADC</name>
                <description>Override value of ArstAdc</description>
                <lsb>15</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>OVRVALPWRUPTXLDO</name>
                <description>Override value of PwrupTxLdo</description>
                <lsb>16</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>OVRVALPWRUPTX</name>
                <description>Override value of PwrupTx</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>OVRVALPWRUPTXPWRCTRL</name>
                <description>Override value of PwrupTxPwrCtrl</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>OVRVALPWRUPTXPA</name>
                <description>Override value of PwrupTxPa</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>OVRVALPWRUPEXTLNA</name>
                <description>Override value of PwrupExtLna</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>OVRVALPWRUPEXTPA</name>
                <description>Override value of PwrupExtPa</description>
                <lsb>26</lsb>
                <msb>26</msb>
              </field>
              <field>
                <name>OVRVALSETRXIF</name>
                <description>Override value of setRxIf</description>
                <lsb>27</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>OVRVALRXAGCEN</name>
                <description>Override value of rxAgcEn</description>
                <lsb>28</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>OVRVALRXDIGEN</name>
                <description>Override value of rxDigEn</description>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>OVRVALPWRUPRXLNAPDET</name>
                <description>Override value of PwrupRxLnaPdet</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>MODEDEPENDENT2</name>
            <description>Mode dependent timing controls</description>
            <addressOffset>0x05C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000014</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TTXRXTURNAROUNDDELTA</name>
                <description>Additional offset in Rx mode, for Rx to be able to be ready earlier, which is required for 2Mbps</description>
                <lsb>0</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>TURNOFFRADIOWRTTXDATAVALID</name>
                <description>Turn off radio with regards to txDataValid in addition to radioEn</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RXAGC</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_RXAGC</headerStructName>
          <access>read-write</access>
          <addressOffset>0x7D0</addressOffset>
          <register>
            <name>GAIN</name>
            <description>Gain boundary settings and gain steps</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x11091107</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>AGCRFGAINMAX</name>
                <description>Maximum gain of RF gain</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>AGCRFGAINMIN</name>
                <description>Minimum gain of RF gain</description>
                <lsb>4</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>AGCRFGAINSTEPUP</name>
                <description>gain step for increasing RF gain</description>
                <lsb>8</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>AGCRFGAINSTEPDOWN</name>
                <description>gain step for decreasing RF gain</description>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>AGCIFGAINMAX</name>
                <description>Maximum gain of IF gain</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>AGCIFGAINMIN</name>
                <description>Minimum gain of IF gain</description>
                <lsb>20</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>AGCIFGAINSTEPUP</name>
                <description>gain step for increasing IF gain</description>
                <lsb>24</lsb>
                <msb>27</msb>
              </field>
              <field>
                <name>AGCIFGAINSTEPDOWN</name>
                <description>gain step for decreasing IF gain</description>
                <lsb>28</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
