ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <register>
          <name>FSASYNCBUSBUSY</name>
          <description>Status bit indicating whether the bus is currently busy or not</description>
          <addressOffset>0x082C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FSASYNCBUSBUSY</name>
              <description>Whether the bus is currently busy or not</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANIONBACKDOORS</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x0830</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000310</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FLIPSSEL</name>
              <description>If 0, we flip the interpretation of the sSel signal (to work around a bug if we have managed to flip it somewhere in the design process)</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>REQUESTCLOCKOVERRIDE</name>
              <description>In normal operation we request clock when pwrupFsLdoDig0 is set. By setting this to 1, we will request clock even when pwrupFsLdoDig0. This may be useful for current measurements of FS_DIG</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>OVRENCK32MCORE</name>
              <description>Make it possible to manually control whether ck32MCore is sent to the AdPll digital island. Needed to test complete clock silence in the AdPll island. It can also be used to enable the clock activity on the clock net even when the clock is not selected.</description>
              <lsb>2</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>OVRVALCK32MCORE</name>
              <description>Whether ck32MCore is active or not when OVRENCK32MCORE is set. See also description of OVRENCK32MCORE</description>
              <lsb>3</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>ONTHEFLYWILLTRIGGER</name>
              <description>0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>RELOADFREQWILLTRIGGER</name>
              <description>0: no relock, 1: first gear of TRK, 2: back to ACQ, 3: back to full lock</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PVTTOT</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x0840</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PVTTOT</name>
              <description>The ratio between PVT and the total cap ratio. Used for Estkmod, Estkdtc and TdcReadout</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>KDTC</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x0844</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>KDTC</name>
              <description>The estimated kDTV value in typical</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXHFGAIN</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x0848</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TXHFGAIN</name>
              <description>The gain for the HF path</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PVTTOFIX</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x084C</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PVTTOFIX</name>
              <description>Calibration value for the PLL</description>
              <lsb>0</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TRACING</name>
          <description>Enable tracing from AdPll</description>
          <addressOffset>0x0850</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable tracing from AdPll</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>IFFREQ</name>
          <description>Select between two different IF frequencies</description>
          <addressOffset>0x0854</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IFFREQ</name>
              <description>Select which IF frequency to use</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1MHz</name>
                  <description>1 MHz IF</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2MHz</name>
                  <description>2 MHz IF</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MHz</name>
                  <description>4 MHz IF</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLCOMPANIONSTATE</name>
          <description>State in the AdPllCompanion state machines</description>
          <addressOffset>0x0858</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BUSSCHEDULERSTATE</name>
              <description>The state of the state machine which sends commands automatically at startup</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>BUSMASTERSTATE</name>
              <description>The state of the async bus master</description>
              <lsb>4</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CLOCKSWITCHSTATE</name>
              <description>The state of the clock switching state machine</description>
              <lsb>8</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>UNITRIGCALSTATE</name>
              <description>The state of the universal trigger calibration routine</description>
              <lsb>12</lsb>
              <msb>14</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>RELOADFREQINTERNAL</name>
          <description>Non-official task: AdPll will reread the frequency input signal</description>
          <addressOffset>0x0870</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGGER</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNITRIGCALSTART</name>
          <description>Non-official task: Start automatic universal trigger calibration</description>
          <addressOffset>0x0874</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGGER</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FSSENDSETTINGS</name>
          <description>Non-official task: Send the auto-settings to AdPll again. This also happens at every startup</description>
          <addressOffset>0x0878</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGGER</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CHANGEPHASEINTERNAL</name>
          <description>Non-official task: AdPll will change the phase as given by the internal AdPll register PHASE_CHANGE</description>
          <addressOffset>0x087C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGGER</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>UNITRIGCALDONE</name>
          <description>Non-official event: Start automatic universal trigger calibration</description>
          <addressOffset>0x0880</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>REJECTEDTRANS</name>
          <description>Non-official event: The command written to AdPll was rejected because of an ongoing transaction</description>
          <addressOffset>0x0884</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>COMPLETETRANS</name>
          <description>Non-official event: Completed a transaction to AdPll successfully (only when CHECKSTATUS is set)</description>
          <addressOffset>0x0888</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FAILEDTRANS</name>
          <description>Non-official event: Did not successfully complete a transaction to AdPll. (only when CHECKSTATUS is set)</description>
          <addressOffset>0x088C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VAL</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>OVERRIDEFREQ</name>
          <description>Raw frequency configuration which also allows selecting frequency outside the 2.4 GHz band</description>
          <addressOffset>0x0890</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FREQMHZ</name>
              <description>Select frequency in MHz. This is a debug feature and only certain band regions will be available on different devices. The users is expected to know what is possible if using this register.</description>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>OVREN</name>
              <description>When 1, the fequency specified by OVERRIDEFREQ.FREQMHZ and FSFREQFINETUNE is used</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLTRIMCOMMAND0</name>
          <description>This value is written to the AdPll when powering up the digital island. Never reset with SOFTRESET</description>
          <addressOffset>0x08A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLTRIMCOMMAND1</name>
          <description>This value is written to the AdPll when powering up the digital island. Never reset with SOFTRESET</description>
          <addressOffset>0x08A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLTRIMCOMMAND2</name>
          <description>This value is written to the AdPll when powering up the digital island. NEVER reset with SOFTRESET</description>
          <addressOffset>0x08A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLTRIMCOMMAND3</name>
          <description>This value is written to the AdPll when powering up the digital island. NEVER reset with SOFTRESET</description>
          <addressOffset>0x08AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLSTARTUPCOMMAND0</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x08B0</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLSTARTUPCOMMAND1</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x08B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLSTARTUPCOMMAND2</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x08B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADPLLSTARTUPCOMMAND3</name>
          <description>This value is written to the AdPll when powering up the digital island</description>
          <addressOffset>0x08BC</addressOffset>
          <access>read-write</access>
          <resetValue>0x80000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>VALUE</name>
              <description>The value to be written the register in the digital island</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>ADDRESS</name>
              <description>The address of the digital island to write to</description>
              <lsb>16</lsb>
              <msb>27</msb>
            </field>
            <field>
              <name>DONOTTRANSFER</name>
              <description>When 1, we do not transfer this word to AdPll at power up</description>
              <lsb>31</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
