ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
          <cluster>
            <name>OUTPEAKDET</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_CHANNELFILTERS_OUTPEAKDET</headerStructName>
            <access>read-write</access>
            <addressOffset>0x008</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the output outPeakDet</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SOURCE</name>
              <description>Source select register for the output outPeakDet</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000003</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SOURCE</name>
                  <description>Data source select</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SrcInMain</name>
                      <description>SRC_INMAIN (NOT LEGAL)</description>
                      <value>0xF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcIIR0</name>
                      <description>SRC_IIR0 (NOT LEGAL)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcIIR1</name>
                      <description>SRC_IIR1 (NOT LEGAL)</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcNotchIIR0</name>
                      <description>SRC_NOTCHIIR0 (NOT LEGAL)</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcNotchIIR1</name>
                      <description>SRC_NOTCHIIR1</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcDecFIR</name>
                      <description>SRC_DECFIR</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>IIR0</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_CHANNELFILTERS_IIR0</headerStructName>
            <access>read-write</access>
            <addressOffset>0x010</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the PUnit IIR0 of type IP_IIR2</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Status register for the PUnit IIR0 of type IP_IIR2</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>IQSATURATION</name>
                  <description>Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear)</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB0</name>
              <description>Coefficient register B0 for the PUnit IIR0 of type IP_IIR2</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000080</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB0</name>
                  <description>Signed filter coefficient B0</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB1</name>
              <description>Coefficient register B1 for the PUnit IIR0 of type IP_IIR2</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000080</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB1</name>
                  <description>Signed filter coefficient B1</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB2</name>
              <description>Coefficient register B2 for the PUnit IIR0 of type IP_IIR2</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB2</name>
                  <description>Signed filter coefficient B2</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSA1</name>
              <description>Coefficient register A1 for the PUnit IIR0 of type IP_IIR2</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000D00</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFA1</name>
                  <description>Signed filter coefficient A1</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSA2</name>
              <description>Coefficient register A2 for the PUnit IIR0 of type IP_IIR2</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFA2</name>
                  <description>Signed filter coefficient A2</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>IIR1</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_CHANNELFILTERS_IIR1</headerStructName>
            <access>read-write</access>
            <addressOffset>0x02C</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the PUnit IIR1 of type IP_IIR2</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>STATUS</name>
              <description>Status register for the PUnit IIR1 of type IP_IIR2</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <size>0x20</size>
              <fields>
                <field>
                  <name>IQSATURATION</name>
                  <description>Saturation status for I/Q (bit 0/1) component (bitwise write 1 to clear)</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB0</name>
              <description>Coefficient register B0 for the PUnit IIR1 of type IP_IIR2</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000060</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB0</name>
                  <description>Signed filter coefficient B0</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB1</name>
              <description>Coefficient register B1 for the PUnit IIR1 of type IP_IIR2</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000060</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB1</name>
                  <description>Signed filter coefficient B1</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSB2</name>
              <description>Coefficient register B2 for the PUnit IIR1 of type IP_IIR2</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000060</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFB2</name>
                  <description>Signed filter coefficient B2</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSA1</name>
              <description>Coefficient register A1 for the PUnit IIR1 of type IP_IIR2</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000A00</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFA1</name>
                  <description>Signed filter coefficient A1</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>COEFFSA2</name>
              <description>Coefficient register A2 for the PUnit IIR1 of type IP_IIR2</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000300</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>COEFFA2</name>
                  <description>Signed filter coefficient A2</description>
                  <lsb>0</lsb>
                  <msb>11</msb>
                </field>
              </fields>
            </register>
          </cluster>
          <cluster>
            <name>NOTCHIIR0</name>
            <description>Unspecified</description>
            <headerStructName>RADIO_CHANNELFILTERS_NOTCHIIR0</headerStructName>
            <access>read-write</access>
            <addressOffset>0x048</addressOffset>
            <register>
              <name>CKSEL</name>
              <description>Clock select register for the PUnit notchIIR0 of type IP_IIR2</description>
              <addressOffset>0x000</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>CKSEL</name>
                  <description>Number of times to divide the base clock rate by 2. Exception: highest value gives BYPASS, ie. clock is disabled and data out is assigned directly from data in.</description>
                  <lsb>0</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ClkSel32M</name>
                      <description>CKSEL_32M</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel16M</name>
                      <description>CKSEL_16M</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel8M</name>
                      <description>CKSEL_8M</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel4M</name>
                      <description>CKSEL_4M</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel2M</name>
                      <description>CKSEL_2M</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel1M</name>
                      <description>CKSEL_1M</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSel500K</name>
                      <description>CKSEL_500K</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ClkSelBypass</name>
                      <description>CKSEL_BYPASS</description>
                      <value>0x7</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>SOURCE</name>
              <description>Source select register for the PUnit notchIIR0 of type IP_IIR2</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000001</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SOURCE</name>
                  <description>Data source select</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>SrcInMain</name>
                      <description>SRC_INMAIN (NOT LEGAL)</description>
                      <value>0xF</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcIIR0</name>
                      <description>SRC_IIR0 (NOT LEGAL)</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcIIR1</name>
                      <description>SRC_IIR1</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcNotchIIR0</name>
                      <description>SRC_NOTCHIIR0 (NOT LEGAL)</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcNotchIIR1</name>
                      <description>SRC_NOTCHIIR1 (NOT LEGAL)</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SrcDecFIR</name>
                      <description>SRC_DECFIR</description>
                      <value>0x4</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
              </fields>
            </register>
