ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <register>
          <name>STTCNFG</name>
          <description>Strobe time tracking Configuration (Symbol Timing)</description>
          <addressOffset>0xB74</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>STTALPHA</name>
              <description>Strobe time tracking: IIR filter alpha</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>STTERRORTH</name>
              <description>Strobe time tracking: strobe time error threshold</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>STTTIMEOUT</name>
              <description>Strobe time tracking: adjustment timeout (min distance in symbolperiods between strobe adjustments in same direction)</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIFTLR</name>
          <description>Drift Controls in Long Range</description>
          <addressOffset>0xB78</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000033C</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DRIFTHALPHA125</name>
              <description>Override value for IIR feedback , drift estimator (despreadLELLong)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>DRIFTVALIDTH125</name>
              <description>Override value for driftValidTh, drift estimator (despreadLELLong)</description>
              <lsb>8</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>DRIFTLOWTH125</name>
              <description>Override value for driftLowTh, drift estimator (despreadLELLong)</description>
              <lsb>24</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIFT1</name>
          <description>Drift Estimator configuration</description>
          <addressOffset>0xB7C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002820</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALPHA</name>
              <description>Override value for IIR feedback , drift estimator (hypermode)</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>VALIDTH</name>
              <description>Override value for driftValidTh, drift estimator (hypermode)</description>
              <lsb>8</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>SATENABLEALWAYS</name>
              <description>Enable saturation in drift calculator for all modes</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DRIFT2</name>
          <description>Drift Estimator configuration</description>
          <addressOffset>0xB80</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C8A0008</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>LOWTH</name>
              <description>Override value for driftLowTh, drift estimator (hypermode)</description>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
            <field>
              <name>MAXDIST</name>
              <description>Override value for driftMaxDist, drift estimator (hypermode)</description>
              <lsb>16</lsb>
              <msb>19</msb>
            </field>
            <field>
              <name>DELAYTH</name>
              <description>Override value for driftDelayTh, drift estimator (hypermode)</description>
              <lsb>20</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DSSS</name>
          <description>DSSS synchronizer trim values</description>
          <addressOffset>0xB84</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000202</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PEAKDISTTOL</name>
              <description>Override for dsssPeakDistanceTolerance</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>MINPEAKCOUNT</name>
              <description>Override for dsssMinPeakCount</description>
              <lsb>8</lsb>
              <msb>10</msb>
            </field>
            <field>
              <name>MINPEAKCOUNTSTRICT</name>
              <description>Min number of peaks to detect before resyncing to another preamble while already working on a previous preamble in BleLrx. Also applies for Ieee 802.15.4 mode</description>
              <lsb>16</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>ENCFOAVE</name>
              <description>Enable CFO averaging</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
            <field>
              <name>ENSTAVE</name>
              <description>Enable strobe time averaging</description>
              <lsb>25</lsb>
              <msb>25</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>AUTOCORR</name>
          <description>Autocorrelator configuration</description>
          <addressOffset>0xB88</addressOffset>
          <access>read-write</access>
          <resetValue>0x0007BD0F</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EN</name>
              <description>Enable autocorrelator gating of peaks.</description>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
            <field>
              <name>ADAPEN</name>
              <description>Enable adaptive autocorrelator threshold settings based on historically observed correlator output values.</description>
              <lsb>1</lsb>
              <msb>1</msb>
            </field>
            <field>
              <name>TH</name>
              <description>Default correlator threshold for deciding if valid correlator match is seen. Low setting of 0.10 is default.</description>
              <lsb>2</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>ADAPTH</name>
              <description>A ratio to update the autocorrelator ratio threshold when adaptive threshold is enabled and a strong peak is found. Fraction of highest correlator match historically seen. Setting of 0.8125 is default.</description>
              <lsb>7</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>ADAPDE</name>
              <description>A ratio to decay the autocorrelator ratio threshold when using adaptive threshold and a weak peak is found.</description>
              <lsb>12</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>ALPHA</name>
              <description>Gain factor for low pass filter used to smoothen autocorrelator output. Set to 0000 indicates to select Max filter instead of LPF.</description>
              <lsb>17</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>OFFS</name>
              <description>Offset for comparing between current and historical AC magnitude</description>
              <lsb>21</lsb>
              <msb>27</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>LRSYNC</name>
          <description>LrSyncEngine configuration</description>
          <addressOffset>0xB8C</addressOffset>
          <access>read-write</access>
          <resetValue>0x003D1DE0</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Modifying how the multiple lr125Front modules are used when synchronizing.</description>
              <lsb>0</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AllFrontends</name>
                  <description>Use all the front ends</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OneFrontend</name>
                  <description>Use only one front end</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COUNTERLELRBLKECAC</name>
              <description>A counter is used to indicate the time window of e-CAC check. It counts the number of outputs from DeSpreadLELong and compares it with this configured value to see whether e-CAC result is valid.</description>
              <lsb>4</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>COUNTERREDUCTION</name>
              <description>When a strong peak event is triggered and the average peak strength is higher than the history stored in the block, the timeout counter is reduced by the number configured in this register. The default value is 7.</description>
              <lsb>10</lsb>
              <msb>13</msb>
            </field>
            <field>
              <name>COUNTERLELRBLKTO</name>
              <description>A counter is used to reset the LelrBlk125 block that is active. It counts the number of outputs from DeSpreadLELong and compares it with this configured value to see whether a timeout event happens. The range is 32 to 60. Default value is 52.</description>
              <lsb>14</lsb>
              <msb>18</msb>
            </field>
            <field>
              <name>POSSTARTTRACKER</name>
              <description>A toggle to tell when to start the trackers inside each LelrBlk125.</description>
              <lsb>19</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>disabled for all times</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAfterFec1</name>
                  <description>enabled after FEC1 is decoded</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAfterFrameSync</name>
                  <description>enabled after frame sync is achieved</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EnabledAfterLelrBlk125</name>
                  <description>enabled after LelrBlk125 is activated</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSMODE</name>
              <description>Select between classic and MLSD based frame sync</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Classic</name>
                  <description>classic mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Mlsd</name>
                  <description>MLSD mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE26</name>
          <description>Override for selecting whether to use LrSyncEngine or the classic demodulator.</description>
          <addressOffset>0xB90</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>USELRSYNCENGINE</name>
              <description>Select whether to use LrSyncEngine or the classic demodulator.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Classic</name>
                  <description>use classic demodulator</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LrSyncEngine</name>
                  <description>Use LrSyncEngine demodulator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>QOVERRIDE27</name>
          <description>Override for selecting whether to use enhanced IEEE 802.15.4 or the classic IEEE 802.15.4 demodulator.</description>
          <addressOffset>0xB94</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>USE154SYNCENGINE</name>
              <description>Select whether to use enhanced IEEE 802.15.4 or the classic IEEE 802.15.4 demodulator.</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Classic</name>
                  <description>Use classic demodulator</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Ieee154SyncEngine</name>
                  <description>Use IEEE 802.15.4 sync demodulator</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFDMATCHRXSYNC154</name>
              <description>SFD match configuration in RxSyncEngine for improved IEEE 802.15.4</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Default</name>
                  <description>Use SFD match from RxSyncEngine</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Override</name>
                  <description>Use SFD match from UTxRxChain</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXSYNC</name>
          <description>RxSyncEngine configuration</description>
          <addressOffset>0xB98</addressOffset>
          <access>read-write</access>
          <resetValue>0x00006390</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ALPHAFREQ</name>
              <description>Coefficient to update frequency offset. Default value is 10000, corresponds to 1/2.</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>BETAFREQ</name>
              <description>Coefficient to update frequency offset. Default value is 11100, corresponds to 7/8.</description>
              <lsb>5</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>PEAKTH</name>
              <description>Threshold value for peak strength. Default value is 0001100, corresponds to (0.31^2) scaled by 2^7 .</description>
              <lsb>10</lsb>
              <msb>16</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCONFIG</name>
          <description>Tx configuration</description>
          <addressOffset>0xC00</addressOffset>
          <access>read-write</access>
          <resetValue>0x00005878</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CODEPOLY0</name>
              <description>Code polynomial 0</description>
              <lsb>0</lsb>
              <msb>6</msb>
            </field>
            <field>
              <name>CODEPOLY1</name>
              <description>Code polynomial 1</description>
              <lsb>8</lsb>
              <msb>14</msb>
            </field>
            <field>
              <name>LRSPREADSWAP</name>
              <description>Swap pattern mapping. Default 0, 0 is mapped to a 0011 sequence, 1 is mapped to a 1100 sequence. If swap bit is set, 1 is mapped to a 0011 sequence, 0 is mapped to a 1100 sequence.</description>
              <lsb>16</lsb>
              <msb>16</msb>
            </field>
            <field>
              <name>BYPASSPRECODE</name>
              <description>Bypass MSK precoding</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NotBypassed</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Bypassed</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQMODENABLE</name>
              <description>Enable IQ modulator</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TXCTRL</name>
          <description>Tx control</description>
          <addressOffset>0xC04</addressOffset>
          <access>read-write</access>
          <resetValue>0x00010000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>BLELONGRANGE</name>
              <description>Enable Tx for BLE long range modes (Do not enable both Ieee802154_250Kbit and BLE long range)</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable Tx for BLE long range modes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable Tx for BLE long range modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEEE802154</name>
              <description>Enable Tx for Ieee802154_250Kbit mode and long range modes (Do not enable both Ieee802154_250Kbit and long range)</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable Tx for Ieee802154_250Kbit mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable Tx for Ieee802154_250Kbit mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQMODINDEX</name>
              <description>IQMOD modulation index</description>
              <lsb>8</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ModIndex0h25</name>
                  <description>Modulation index = 0.25(Future)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex0h32</name>
                  <description>Modulation index = 0.32(Future)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex0h5</name>
                  <description>Modulation index = 0.5(Future)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex1h0</name>
                  <description>Modulation index = 1(Future)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ModIndex2h0</name>
                  <description>Modulation index = 2(Future)</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQMODBT</name>
              <description>IQMOD GFSK bandwidth</description>
              <lsb>16</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1BT00</name>
                  <description>BT=1.00</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0BT60</name>
                  <description>BT=0.60</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BT00</name>
                  <description>BT=2.00</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>0BT40</name>
                  <description>BT=0.40</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IQMODSYMBOL</name>
              <description>IQMOD additional symbol mapping not set by MODE(Future)</description>
              <lsb>20</lsb>
              <msb>22</msb>
            </field>
          </fields>
        </register>
