ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <register>
          <name>AACHKOVERRIDE</name>
          <description>Address Check Override</description>
          <addressOffset>0xE98</addressOffset>
          <access>read-write</access>
          <resetValue>0x02600000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENDCOUNTHYPSTD</name>
              <description>Defines maximum number of PDU bits to compare between Hyper and Std demodulator</description>
              <lsb>0</lsb>
              <msb>9</msb>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable AA bit 15 check</description>
              <lsb>12</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AA16to31</name>
                  <description>Enable AA16..31</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA15to31</name>
                  <description>Enable AA15..31</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA14to31</name>
                  <description>Enable AA14..31</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA13to31</name>
                  <description>Enable AA13..31</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA12to31</name>
                  <description>Enable AA12..31</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA11to31</name>
                  <description>Enable AA11..31</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA10to31</name>
                  <description>Enable AA10..31</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA9to31</name>
                  <description>Enable AA9..31</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA8to31</name>
                  <description>Enable AA8..31 (when 32-bit AA is enabled)</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA7to31</name>
                  <description>Enable AA7..31 (when 32-bit AA is enabled)</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA6to31</name>
                  <description>Enable AA6..31 (when 32-bit AA is enabled)</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA5to31</name>
                  <description>Enable AA5..31 (when 32-bit AA is enabled)</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA4to31</name>
                  <description>Enable AA4..31 (when 32-bit AA is enabled)</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA3to31</name>
                  <description>Enable AA3..31 (when 32-bit AA is enabled)</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA2to31</name>
                  <description>Enable AA2..31 (when 32-bit AA is enabled)</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AA1to31</name>
                  <description>Enable AA1..31 (when 32-bit AA is enabled)</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISABLE</name>
              <description>Disable std AA checker</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable std AA checker</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable std AA checker</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ALLOWADDRMATCHEARLY</name>
              <description>Enable ignore std AA checker before shift register filled</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PERFECTADDRWINDOW</name>
              <description>Enable timing accurate address match window in demodulator</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The address window has some margin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The address window spans only one bit</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SFDMATCHENABLE</name>
              <description>Enable every 4 bits SFD match for IEEE 802.15.4</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Disable</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Enable</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYMSBEFORESFD</name>
              <description>Number of preamble symbols before SFD to match, by default 2 symbols.</description>
              <lsb>24</lsb>
              <msb>26</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETCNTR1</name>
          <description>Unspecified</description>
          <addressOffset>0xE9C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>COUNTER</name>
              <description>Packet counter value</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETCNTR2</name>
          <description>Unspecified</description>
          <addressOffset>0xEA0</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>HYPER</name>
              <description>Number of detected correlator syncs</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>NORMAL</name>
              <description>Packet counter value (number of packets with addressmatch ok)</description>
              <lsb>16</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTESTATUS</name>
          <description>CTEInfo parsed from received packet</description>
          <addressOffset>0xEA4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTETIME</name>
              <description>CTETime parsed from packet</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>RFU</name>
              <description>RFU parsed from packet</description>
              <lsb>5</lsb>
              <msb>5</msb>
            </field>
            <field>
              <name>CTETYPE</name>
              <description>CTEType parsed from packet</description>
              <lsb>6</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HYPSTDCHECKSTAT</name>
          <description>Address Check Override</description>
          <addressOffset>0xEA8</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PDUCHECK0</name>
              <description>Number of bits where Std and Hyper demodulator disagrees for minimum latency.</description>
              <lsb>0</lsb>
              <msb>3</msb>
            </field>
            <field>
              <name>PDUCHECK1</name>
              <description>Number of bits where Std and Hyper demodulator disagrees for medium latency.</description>
              <lsb>4</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>PDUCHECK2</name>
              <description>Number of bits where Std and Hyper demodulator disagrees for maximum latency.</description>
              <lsb>8</lsb>
              <msb>11</msb>
            </field>
            <field>
              <name>HAM</name>
              <description>Hamming distance between std demod AA15:0 and expected AA15:0.</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>SPAM</name>
              <description>Time distance #bit clock cycles from AAmatchHyp.</description>
              <lsb>21</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>VALID</name>
              <description>Valid flag bit</description>
              <lsb>24</lsb>
              <msb>24</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>HYPSTDAADIFFVEC</name>
          <description>Address Diff Vector</description>
          <addressOffset>0xEAC</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>DIFF</name>
              <description>Hyper AA15:0 and Std AA15:0 differs</description>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>ADDRWINSIZE</name>
          <description>Address match safe window size (the number of bits after detect is asserted, before starting to look for address match). Only valid when OVERRIDE22.DISABLEADDRWINDOW is '0'.</description>
          <addressOffset>0xEB0</addressOffset>
          <access>read-write</access>
          <resetValue>0x1D111500</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>IEEE802154</name>
              <description>Number of bits after detect to start search address/SFD in IEEE 802.15.4 mode Default value for classic 802.15.4 sync is 0x18</description>
              <lsb>0</lsb>
              <msb>4</msb>
            </field>
            <field>
              <name>BLE</name>
              <description>Number of bits after detect to start search address/SFD in BLE mode</description>
              <lsb>8</lsb>
              <msb>12</msb>
            </field>
            <field>
              <name>LR</name>
              <description>Number of bits after detect to start search address/SFD in BLE_LR_125k/BLE_LR_500k mode</description>
              <lsb>16</lsb>
              <msb>20</msb>
            </field>
            <field>
              <name>ESB</name>
              <description>Number of bits after detect to start search address/SFD in ESB mode</description>
              <lsb>24</lsb>
              <msb>28</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MHRMATCHCONF</name>
          <description>Search pattern configuration</description>
          <addressOffset>0xEB4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MHRMATCHCONF</name>
              <description>Search pattern configuration</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>MHRMATCHMASK</name>
          <description>Pattern mask</description>
          <addressOffset>0xEB8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MHRMATCHMASK</name>
              <description>Pattern mask</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>SFD</name>
          <description>IEEE 802.15.4 start of frame delimiter</description>
          <addressOffset>0xEBC</addressOffset>
          <access>read-write</access>
          <resetValue>0x000000A7</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>SFD</name>
              <description>IEEE 802.15.4 start of frame delimiter. Note: the least significant 4 bits of the SFD cannot all be zeros.</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>CTEINLINECONF</name>
          <description>Configuration for CTE inline mode</description>
          <addressOffset>0xEC0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00002800</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>CTEINLINECTRLEN</name>
              <description>Enable parsing of CTEInfo from received packet in BLE modes</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Parsing of CTEInfo is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Parsing of CTEInfo is disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINFOINS1</name>
              <description>CTEInfo is S1 byte or not</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>InS1</name>
                  <description>CTEInfo is in S1 byte (data PDU)</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NotInS1</name>
                  <description>CTEInfo is NOT in S1 byte (advertising PDU)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEERRORHANDLING</name>
              <description>Sampling/switching if CRC is not OK</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>Sampling and antenna switching also when CRC is not OK</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>No</name>
                  <description>No sampling and antenna switching when CRC is not OK</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEFORCEON</name>
              <description>CTE is continuously output after CRC and only stopped by triggering TASKS_STOP. This is typically used together with the DFEEND to STOP short. AoA/AoD procedure duration is still controlled by DFECTRL1.NUMBEROF8S / CTETIME</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Yes</name>
                  <description>CTE is continuously transmitted after CRC until TASKS_STOP</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>No</name>
                  <description>CTE duration is automatically determined by DFECTRL1.NUMBEROF8US / CTETIME (only correct for 1Mbps and 2Mbps modes)</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTETIMEVALIDRANGE</name>
              <description>Max range of CTETime</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>20</name>
                  <description>20 in 8us unit (default) Set to 20 if parsed CTETime is larger han 20</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>31 in 8us unit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>63 in 8us unit</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINLINERXMODE1US</name>
              <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
              <lsb>10</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTEINLINERXMODE2US</name>
              <description>Spacing between samples for the samples in the SWITCHING period when CTEINLINEMODE is set</description>
              <lsb>13</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>8us</name>
                  <description>8us</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4us</name>
                  <description>4us</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2us</name>
                  <description>2us</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1us</name>
                  <description>1us</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>500ns</name>
                  <description>0.5us</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>250ns</name>
                  <description>0.25us</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>125ns</name>
                  <description>0.125us</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>S0CONF</name>
              <description>S0 bit pattern to match</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>S0MASK</name>
              <description>S0 bit mask to set which bit to match</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMASTART</name>
          <description>Unspecified</description>
          <addressOffset>0xEC4</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIG</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
