ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <register>
          <name>DMASTOP</name>
          <description>Unspecified</description>
          <addressOffset>0xEC8</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIG</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAENABLE</name>
          <description>Unspecified</description>
          <addressOffset>0xECC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <lsb>0</lsb>
              <msb>0</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>PACKETPTR</name>
          <description>Unspecified</description>
          <addressOffset>0xED0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>OFFSET</name>
              <lsb>0</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>BASE</name>
              <lsb>29</lsb>
              <msb>29</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAAMOUNT</name>
          <description>Unspecified</description>
          <addressOffset>0xED4</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>AMOUNT</name>
              <lsb>0</lsb>
              <msb>8</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAMAXCNT</name>
          <description>Unspecified</description>
          <addressOffset>0xED8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000103</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MAXCNT</name>
              <lsb>0</lsb>
              <msb>11</msb>
            </field>
          </fields>
        </register>
        <cluster>
          <name>LBMAC</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_LBMAC</headerStructName>
          <access>read-write</access>
          <addressOffset>0xF00</addressOffset>
          <register>
            <name>CNTPSTART</name>
            <description>Start packet counter</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CNTPSTOP</name>
            <description>Stop packet counter</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CNTPCLEAR</name>
            <description>Clear packet counter</description>
            <addressOffset>0x008</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CRCSTATUS</name>
            <description>CRC status</description>
            <addressOffset>0x00C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CRCSTATUS</name>
                <description>CRC status of packet received</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CRCError</name>
                    <description>Packet received with CRC error</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CRCOk</name>
                    <description>Packet received with CRC ok</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>RXMATCH</name>
            <description>Received address</description>
            <addressOffset>0x010</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXMATCH</name>
                <description>Received address</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>RXCRC</name>
            <description>CRC field of previously received packet</description>
            <addressOffset>0x014</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>RXCRC</name>
                <description>CRC field of previously received packet</description>
                <lsb>0</lsb>
                <msb>23</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>DAI</name>
            <description>Device address match index</description>
            <addressOffset>0x018</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DAI</name>
                <description>Device address match index</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PDUSTAT</name>
            <description>Payload status</description>
            <addressOffset>0x01C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PDUSTAT</name>
                <description>Status on payload length vs. PCNF1.MAXLEN</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LessThan</name>
                    <description>Payload less than PCNF1.MAXLEN</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>GreaterThan</name>
                    <description>Payload greater than PCNF1.MAXLEN</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CISTAT</name>
                <description>Status on what rate packet is received with in Long Range</description>
                <lsb>1</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>LR125kbit</name>
                    <description>Frame is received at 125 kbps</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LR500kbit</name>
                    <description>Frame is received at 500 kbps</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>PCNF0</name>
            <description>Packet configuration register 0</description>
            <addressOffset>0x020</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFLEN</name>
                <description>Length on air of LENGTH field in number of bits.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LENGTHINCL</name>
                <description>Include or exclude LENGTH field in RAM</description>
                <lsb>4</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Automatic</name>
                    <description>Include LENGTH field in RAM only if LFLEN &amp;gt; 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S0LEN</name>
                <description>Length on air of S0 field in number of bytes.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>S0INCL</name>
                <description>Include or exclude S0 field in RAM</description>
                <lsb>12</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Automatic</name>
                    <description>Include S0 field only if S0LEN &amp;gt; 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>S1LEN</name>
                <description>Length on air of S1 field in number of bits.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>S1INCL</name>
                <description>Include or exclude S1 field in RAM</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Automatic</name>
                    <description>Include S1 field in RAM only if S1LEN &amp;gt; 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Always include S1 field in RAM independent of S1LEN</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CILEN</name>
                <description>Length of code indicator - long range</description>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>PLEN</name>
                <description>Length of preamble on air. Decision point: TASKS_START task</description>
                <lsb>24</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8bit</name>
                    <description>8-bit preamble</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16bit</name>
                    <description>16-bit preamble</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32bitZero</name>
                    <description>32-bit zero preamble - used for IEEE 802.15.4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LongRange</name>
                    <description>Preamble - used for BLE long range</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRCINC</name>
                <description>Indicates if LENGTH field contains CRC or not</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>LENGTH does not contain CRC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>LENGTH includes CRC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PREAMPTRN</name>
                <description>Pattern for 32-bit preamble</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AllZeros</name>
                    <description>32-bit all zeros used for IEEE 802.15.4</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BleType</name>
                    <description>32-bit preamble used for 4Mbps to keep the duration indepedant of data rates</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TERMLEN</name>
                <description>Length of TERM field in Long Range operation</description>
                <lsb>29</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCNF0SEC</name>
            <description>Packet configuration register 0 in concurrent receive mode in BLE LR</description>
            <addressOffset>0x024</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFLEN</name>
                <description>Length on air of LENGTH field in number of bits.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>S0LEN</name>
                <description>Length on air of S0 field in number of bytes.</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>S1LEN</name>
                <description>Length on air of S1 field in number of bits.</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>S1INCL</name>
                <description>Include or exclude S1 field in RAM</description>
                <lsb>20</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Automatic</name>
                    <description>Include S1 field in RAM only if S1LEN &amp;gt; 0</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Always include S1 field in RAM independent of S1LEN</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CILEN</name>
                <description>Length of code indicator - long range</description>
                <lsb>22</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>PLEN</name>
                <description>Length of preamble on air. Decision point: TASKS_START task</description>
                <lsb>24</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>8bit</name>
                    <description>8-bit preamble</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>16bit</name>
                    <description>16-bit preamble</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>32bitZero</name>
                    <description>32-bit zero preamble - used for IEEE 802.15.4</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>LongRange</name>
                    <description>Preamble - used for BLE long range</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CRCINC</name>
                <description>Indicates if LENGTH field contains CRC or not</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>LENGTH does not contain CRC</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>LENGTH includes CRC</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PREAMPTRN</name>
                <description>Pattern for 32-bit preamble</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AllZeros</name>
                    <description>32-bit all zeros used for IEEE 802.15.4</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>BleType</name>
                    <description>32-bit preamble used for 4Mbps to keep the duration indepedant of data rates</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>TERMLEN</name>
                <description>Length of TERM field in Long Range operation</description>
                <lsb>29</lsb>
                <msb>30</msb>
              </field>
            </fields>
          </register>
