ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
          <register>
            <name>FREQOFFSET</name>
            <description>Frequency offset estimate</description>
            <addressOffset>0x044</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>FREQOFFSET</name>
                <lsb>0</lsb>
                <msb>13</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PCT11</name>
            <description>Mean magnitude and mean phase converted to IQ. IQ values limited to [-1024,1023].</description>
            <addressOffset>0x048</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PCT11I</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>PCT11Q</name>
                <description>Quadrature</description>
                <lsb>11</lsb>
                <msb>21</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>LFAENEXT</name>
            <description>Quantization error between ADPLL frequency and the desired value of FFO * RF Frequency. Values limited to [-64,63] with units 7.6294 Hz.</description>
            <addressOffset>0x04C</addressOffset>
            <access>read-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LFAENEXT</name>
                <description>Inphase</description>
                <lsb>0</lsb>
                <msb>6</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>RTT</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_RTT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1050</addressOffset>
          <register>
            <name>CONFIG</name>
            <description>RTT Config.</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>EN</name>
                <description>Enable RTT Functionality. Only valid for BLE 1MBPS and 2MBPS mode</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable RTT Block</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable RTT Block</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ENFULLAA</name>
                <description>Enabling/Disable ping over the entire access address.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Disable ping over the entire access address, i.e., enable only over the first 16-bit access address</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Enable ping over the entire access address</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>ROLE</name>
                <description>Role as a Initiator or Reflector.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Initiator</name>
                    <description>Initiator</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Reflector</name>
                    <description>Reflector</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>NUMSEGMENTS</name>
                <description>Number of 16bit payload segments available for ToA detection. Allowed values are 0, 2, 4, 6 and 8.</description>
                <lsb>3</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>EFSDELAY</name>
                <description>Early Frame Sync Delay, i.e., number of cycles to wait for access address to anchor correctly. For 2MBPSBLE mode, the EFSDELAY value is 64 (2us) and for 1MBPSBLE mode, it can be 256 (8us).</description>
                <lsb>8</lsb>
                <msb>16</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT01</name>
            <description>RTT segments 0 and 1</description>
            <addressOffset>0x0004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 31 - 0</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT23</name>
            <description>RTT segments 2 and 3</description>
            <addressOffset>0x0008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 63 - 32</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT45</name>
            <description>RTT segments 4 and 5</description>
            <addressOffset>0x000C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 95 - 64</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>SEGMENT67</name>
            <description>RTT segments 6 and 7</description>
            <addressOffset>0x0010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data Bits 127 - 96</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>DFT</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_DFT</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1D00</addressOffset>
          <register>
            <name>DTB0CONFIG</name>
            <description>Digital Test Bus 0 (DTB0) configuration</description>
            <addressOffset>0x0000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for DTB0</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AnaDtb00</name>
                    <description>SPHYNX_DTB0_AO_0V8[0]</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AafDcCalI</name>
                    <description>SPHYNX_AAF_DCCAL_I_AO_0V8</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RxPkDet0</name>
                    <description>SPHYNX_RX_PKDET_AO_0V8[0]</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare</name>
                    <description>None selected, logic 0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the digital test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DTB1CONFIG</name>
            <description>Digital Test Bus 1 (DTB1) configuration</description>
            <addressOffset>0x0004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for DTB1</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AnaDtb01</name>
                    <description>SPHYNX_DTB0_AO_0V8[1]</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AafDcCalQ</name>
                    <description>SPHYNX_AAF_DCCAL_Q_AO_0V8</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>RfPkDet1</name>
                    <description>SPHYNX_RX_PKDET_AO_0V8[1]</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare</name>
                    <description>None selected, logic 0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the digital test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DTB2CONFIG</name>
            <description>Digital Test Bus 2 (DTB2) configuration</description>
            <addressOffset>0x0008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for DTB2</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AnaDtb02</name>
                    <description>SPHYNX_DTB0_AO_0V8[2]</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>PllSettled</name>
                    <description>pllSettled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FsSpareOutputs0</name>
                    <description>SPHYNX_FS_SPARE_OUTPUTS_AO_0V8[0]</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare</name>
                    <description>None selected, logic 0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the digital test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>DTB3CONFIG</name>
            <description>Digital Test Bus 3 (DTB3) configuration</description>
            <addressOffset>0x000C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SELMUX</name>
                <description>Select multiplexer for DTB3</description>
                <lsb>0</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>AnaDtb03</name>
                    <description>SPHYNX_DTB0_AO_0V8[3]</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FsTxDataReq</name>
                    <description>SPHYNX_FS_TXDATAREQ_AO_0V8</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CalCmpRcCal</name>
                    <description>SPHYNX_CAL_CMP_RCCAL_AO_0V8</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Spare</name>
                    <description>None selected, logic 0</description>
                    <value>0x3</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>EN</name>
                <description>Enable the digital test bus</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Disabled</name>
                    <description>Digital test bus is disabled</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Enabled</name>
                    <description>Digital test bus is enabled</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PENALTYTRIGPCP4</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_PENALTYTRIGPCP4</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1F00</addressOffset>
          <register>
            <name>ZERO</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FULL</name>
            <description>Unspecified</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PENALTYTRIGPCP3</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_PENALTYTRIGPCP3</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1F08</addressOffset>
          <register>
            <name>ZERO</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FULL</name>
            <description>Unspecified</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PENALTYTRIGPCP2</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_PENALTYTRIGPCP2</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1F10</addressOffset>
          <register>
            <name>ZERO</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FULL</name>
            <description>Unspecified</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PENALTYTRIGPCP1</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_PENALTYTRIGPCP1</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1F18</addressOffset>
          <register>
            <name>ZERO</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FULL</name>
            <description>Unspecified</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PENALTYTRIGPCP0</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_PENALTYTRIGPCP0</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1F20</addressOffset>
          <register>
            <name>ZERO</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FULL</name>
            <description>Unspecified</description>
            <addressOffset>0x004</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TRIG</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
            </fields>
          </register>
        </cluster>
        <cluster>
          <name>PENALTYREG</name>
          <description>Unspecified</description>
          <headerStructName>RADIO_PENALTYREG</headerStructName>
          <access>read-write</access>
          <addressOffset>0x1F28</addressOffset>
          <register>
            <name>PCP0</name>
            <description>Unspecified</description>
            <addressOffset>0x000</addressOffset>
            <access>write-only</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>VALUE</name>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
