ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <cluster>
          <name>OVERFLOW</name>
          <description>Unspecified</description>
          <headerStructName>IPCT_OVERFLOW</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <name>SEND</name>
            <description>Overflow status for SEND tasks Write 0 to clear</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>SEND_0</name>
                <description>Overflow status for SEND[0] task</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_1</name>
                <description>Overflow status for SEND[1] task</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_2</name>
                <description>Overflow status for SEND[2] task</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_3</name>
                <description>Overflow status for SEND[3] task</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_4</name>
                <description>Overflow status for SEND[4] task</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_5</name>
                <description>Overflow status for SEND[5] task</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_6</name>
                <description>Overflow status for SEND[6] task</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_7</name>
                <description>Overflow status for SEND[7] task</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_8</name>
                <description>Overflow status for SEND[8] task</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_9</name>
                <description>Overflow status for SEND[9] task</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_10</name>
                <description>Overflow status for SEND[10] task</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SEND_11</name>
                <description>Overflow status for SEND[11] task</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Overflow</name>
                    <description>Task overflow has happened</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NoOverflow</name>
                    <description>Task overflow has not happened</description>
                    <value>0x0</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
