ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
        <register>
          <name>INTPEND2</name>
          <description>Pending interrupts</description>
          <addressOffset>0x32C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>TRIGGERED0</name>
              <description>Read pending status of interrupt for event TRIGGERED[0]</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED1</name>
              <description>Read pending status of interrupt for event TRIGGERED[1]</description>
              <lsb>1</lsb>
              <msb>1</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED2</name>
              <description>Read pending status of interrupt for event TRIGGERED[2]</description>
              <lsb>2</lsb>
              <msb>2</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED3</name>
              <description>Read pending status of interrupt for event TRIGGERED[3]</description>
              <lsb>3</lsb>
              <msb>3</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED4</name>
              <description>Read pending status of interrupt for event TRIGGERED[4]</description>
              <lsb>4</lsb>
              <msb>4</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED5</name>
              <description>Read pending status of interrupt for event TRIGGERED[5]</description>
              <lsb>5</lsb>
              <msb>5</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED6</name>
              <description>Read pending status of interrupt for event TRIGGERED[6]</description>
              <lsb>6</lsb>
              <msb>6</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED7</name>
              <description>Read pending status of interrupt for event TRIGGERED[7]</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED8</name>
              <description>Read pending status of interrupt for event TRIGGERED[8]</description>
              <lsb>8</lsb>
              <msb>8</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED9</name>
              <description>Read pending status of interrupt for event TRIGGERED[9]</description>
              <lsb>9</lsb>
              <msb>9</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED10</name>
              <description>Read pending status of interrupt for event TRIGGERED[10]</description>
              <lsb>10</lsb>
              <msb>10</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED11</name>
              <description>Read pending status of interrupt for event TRIGGERED[11]</description>
              <lsb>11</lsb>
              <msb>11</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED12</name>
              <description>Read pending status of interrupt for event TRIGGERED[12]</description>
              <lsb>12</lsb>
              <msb>12</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED13</name>
              <description>Read pending status of interrupt for event TRIGGERED[13]</description>
              <lsb>13</lsb>
              <msb>13</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED14</name>
              <description>Read pending status of interrupt for event TRIGGERED[14]</description>
              <lsb>14</lsb>
              <msb>14</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED15</name>
              <description>Read pending status of interrupt for event TRIGGERED[15]</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED16</name>
              <description>Read pending status of interrupt for event TRIGGERED[16]</description>
              <lsb>16</lsb>
              <msb>16</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED17</name>
              <description>Read pending status of interrupt for event TRIGGERED[17]</description>
              <lsb>17</lsb>
              <msb>17</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED18</name>
              <description>Read pending status of interrupt for event TRIGGERED[18]</description>
              <lsb>18</lsb>
              <msb>18</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED19</name>
              <description>Read pending status of interrupt for event TRIGGERED[19]</description>
              <lsb>19</lsb>
              <msb>19</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED20</name>
              <description>Read pending status of interrupt for event TRIGGERED[20]</description>
              <lsb>20</lsb>
              <msb>20</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED21</name>
              <description>Read pending status of interrupt for event TRIGGERED[21]</description>
              <lsb>21</lsb>
              <msb>21</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED22</name>
              <description>Read pending status of interrupt for event TRIGGERED[22]</description>
              <lsb>22</lsb>
              <msb>22</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED23</name>
              <description>Read pending status of interrupt for event TRIGGERED[23]</description>
              <lsb>23</lsb>
              <msb>23</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED24</name>
              <description>Read pending status of interrupt for event TRIGGERED[24]</description>
              <lsb>24</lsb>
              <msb>24</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED25</name>
              <description>Read pending status of interrupt for event TRIGGERED[25]</description>
              <lsb>25</lsb>
              <msb>25</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED26</name>
              <description>Read pending status of interrupt for event TRIGGERED[26]</description>
              <lsb>26</lsb>
              <msb>26</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED27</name>
              <description>Read pending status of interrupt for event TRIGGERED[27]</description>
              <lsb>27</lsb>
              <msb>27</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED28</name>
              <description>Read pending status of interrupt for event TRIGGERED[28]</description>
              <lsb>28</lsb>
              <msb>28</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED29</name>
              <description>Read pending status of interrupt for event TRIGGERED[29]</description>
              <lsb>29</lsb>
              <msb>29</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED30</name>
              <description>Read pending status of interrupt for event TRIGGERED[30]</description>
              <lsb>30</lsb>
              <msb>30</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Pending</name>
                  <description>Read: Pending</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TRIGGERED31</name>
              <description>Read pending status of interrupt for event TRIGGERED[31]</description>
              <lsb>31</lsb>
              <msb>31</msb>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>NotPending</name>
                  <description>Read: Not pending</description>
