ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
          <register>
            <name>PHYULPSCTRL</name>
            <description>Configures entering and leaving ULPS in the D-PHY.</description>
            <addressOffset>0x0A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYTXREQULPSCLK</name>
                <description>ULPS mode Request on clock lane.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PHYTXEXITULPSCLK</name>
                <description>ULPS mode Exit on clock lane.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>PHYTXREQULPSLAN</name>
                <description>ULPS mode Request on all active data lanes.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>PHYTXEXITULPSLAN</name>
                <description>ULPS mode Exit on all active data lanes.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTXTRIGGERS</name>
            <description>Configures the pins that activate triggers in the D-PHY.</description>
            <addressOffset>0x0AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYTXTRIGGERS</name>
                <description>This field controls the trigger transmissions.</description>
                <lsb>0</lsb>
                <msb>3</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYSTATUS</name>
            <description>Contains information about the status of the D-PHY.</description>
            <addressOffset>0x0B0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000140</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYLOCK</name>
                <description>This bit indicates the status of phylock D-PHY signal.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYDIRECTION</name>
                <description>This bit indicates the status of phydirection D-PHY signal.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYSTOPSTATECLKLANE</name>
                <description>This bit indicates the status of phystopstateclklane D-PHY signal.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYULPSACTIVENOTCLK</name>
                <description>This bit indicates the status of phyulpsactivenotclk D-PHY signal.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYSTOPSTATE0LANE</name>
                <description>This bit indicates the status of phystopstate0lane D-PHY signal.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYULPSACTIVENOT0LANE</name>
                <description>This bit indicates the status of ulpsactivenot0lane D-PHY signal.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYRXULPSESC0LANE</name>
                <description>This bit indicates the status of rxulpsesc0lane D-PHY signal.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYSTOPSTATE1LANE</name>
                <description>This bit indicates the status of phystopstate1lane D-PHY signal.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYULPSACTIVENOT1LANE</name>
                <description>This bit indicates the status of ulpsactivenot1lane D-PHY signal.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTSTCTRL0</name>
            <description>Controls clock and clear pins of the D-PHY vendor specific interface.</description>
            <addressOffset>0x0B4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000001</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYTESTCLR</name>
                <description>PHY test interface clear (active high).</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>PHYTESTCLK</name>
                <description>This bit is used to clock the TESTDIN bus into the D-PHY.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>PHYTSTCTRL1</name>
            <description>Controls data and enable pins of the D-PHY vendor specific interface.</description>
            <addressOffset>0x0B8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>PHYTESTDIN</name>
                <description>PHY test interface input 8-bit data bus for internal register programming and test functionalities access.</description>
                <lsb>0</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>PHTTESTDOUT</name>
                <description>PHY output 8-bit data bus for read-back and internal probing functionalities.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PHYTESTEN</name>
                <description>PHY test interface operation selector:</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>WRITEDATA</name>
                    <description>the data write operation is set on the rising edge of the testclk signal.</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>WRITEADDR</name>
                    <description>the address write operation is set on the falling edge of the testclk signal.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>PHYTESTSEL</name>
                <description>PHY BiDIR MUX selector</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>INTST0</name>
            <description>Contains the status of interrupt sources from acknowledge reports and the D-PHY.</description>
            <addressOffset>0x0BC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ACKWITHERR0</name>
                <description>This bit retrieves the SoT error from the Acknowledge error report.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR1</name>
                <description>This bit retrieves the SoT Sync error from the Acknowledge error report.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR2</name>
                <description>This bit retrieves the EoT Sync error from the Acknowledge error report.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR3</name>
                <description>This bit retrieves the Escape Mode Entry Command error from the Acknowledge error report.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR4</name>
                <description>This bit retrieves the low-power Transmit Sync error from the Acknowledge error report.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR5</name>
                <description>This bit retrieves the Peripheral Timeout error from the Acknowledge error report.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR6</name>
                <description>This bit retrieves the False Control error from the Acknowledge error report.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR7</name>
                <description>This bit retrieves the Contention Detected error from the Acknownledge error report.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR8</name>
                <description>This bit retrieves the ECC error, single-bit (detected and corrected) from the Acknowledge error report.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR9</name>
                <description>This bit retrieves the ECC error, multi-bit (detected, not corrected) from the Acknowledge error report.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR10</name>
                <description>This bit retrieves the checksum error (long packet only) from the Acknowledge error report.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR11</name>
                <description>This bit retrieves the not recognized DSI data type from the Acknowledge error report.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR12</name>
                <description>This bit retrieves the DSI VC ID Invalid from the Acknowledge error report.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR13</name>
                <description>This bit retrieves the invalid transmission length from the Acknowledge error report.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR14</name>
                <description>This bit retrieves the reserved (specific to device) from the Acknowledge error report.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ACKWITHERR15</name>
                <description>This bit retrieves the DSI protocol violation from the Acknowledge error report.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPHYERRORS0</name>
                <description>This bit indicates ErrEsc escape entry error from Lane 0.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPHYERRORS1</name>
                <description>This bit indicates ErrSyncEsc low-power data transmission synchronization error from Lane 0.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPHYERRORS2</name>
                <description>This bit indicates control error ErrControl from Lane 0.</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPHYERRORS3</name>
                <description>This bit indicates LP0 contention error ErrContentionLP0 from Lane 0.</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPHYERRORS4</name>
                <description>This bit indicates LP1 contention error ErrContentionLP1 from Lane 0.</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTST1</name>
            <description>Contains the status of interrupt sources related to timeouts, ECC, CRC, packet size, EoTp, Generic and DBI interfaces.</description>
            <addressOffset>0x0C0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TOHSTX</name>
                <description>This bit indicates that the high-speed transmission timeout counter reached the end and contention has been detected.</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>TOLPRX</name>
                <description>This bit indicates that the low-power reception timeout counter reached the end and contention has been detected.</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ECCSINGLEERR</name>
                <description>This bit indicates that the ECC single error has been detected and corrected in a received packet.</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>ECCMULTPLERR</name>
                <description>This bit indicates that the ECC multiple error has been detected in a received packet.</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>CRCERR</name>
                <description>This bit indicates that the CRC error has been detected in the received packet payload.</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>PKTSIZEERR</name>
                <description>This bit indicates that the packet size error has been detected during the packet reception.</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>EOPTERR</name>
                <description>This bit indicates that the EoTp packet has not been received at the end of the incoming peripheral transmission.</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPIPLDWRERR</name>
                <description>This bit indicates that during a DPI pixel line storage, the payload FIFO becomes full and the data stored is corrupted.</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENCMDWRERR</name>
                <description>This bit indicates that the system tried to write a command through the Generic interface and the FIFO is full. Therefore, the command is not written.</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENPLDWRERR</name>
                <description>This bit indicates that the system tried to write a payload data through the Generic interface and the FIFO is full. Therefore, the payload is not written.</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENPLDSENDERR</name>
                <description>This bit indicates that during a Generic interface packet build, the payload FIFO becomes empty and corrupt data is sent.</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENPLDRDERR</name>
                <description>This bit indicates that during a DCS read data, the payload FIFO becomes empty and the data sent to the interface is corrupted.</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>GENPLDRECEVERR</name>
                <description>This bit indicates that during a generic interface packet read back, the payload FIFO becomes full and the received data is corrupted.</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBICMDWRERR</name>
                <description>This bit indicates that the system tried to write a command through the DBI but the command FIFO is full. Therefore, the command is not written.</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIPLDWRERR</name>
                <description>This bit indicates that the system tried to write the payload data through the DBI interface and the FIFO is full. Therefore, the command is not written.</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIPLDRDERR</name>
                <description>This bit indicates that during a DCS read data, the payload FIFO goes empty and the data sent to the interface is corrupted.</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIPLDRECVERR</name>
                <description>This bit indicates that during a DBI read back packet, the payload FIFO becomes full and the received data is corrupted.</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DBIILEGALCOMMERR</name>
                <description>This bit indicates that an attempt to write an illegal command on the DBI interface is made and the controller is blocked by transmission.</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <access>read-only</access>
              </field>
              <field>
                <name>DPIBUFFPLDUNDER</name>
                <description>This bit indicates that an underflow has occurred when reading payload to build DSI packet for video mode</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
