ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
          <register>
            <name>MIPPARTIAL</name>
            <description>MiP partial and full frame update register, used by MiP-Parallel interface.</description>
            <addressOffset>0x140</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MIPPARTIALSTART</name>
                <description>Indicates the first row of the given partial or full frame region.</description>
                <lsb>0</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>MIPPARTIALEND</name>
                <description>Indicates the last row of the given partial or full frame region.</description>
                <lsb>12</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>POS24LEN6</name>
                <lsb>24</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>IPVERSION</name>
            <description>Indicates the current version of NemaDC IP</description>
            <addressOffset>0x180</addressOffset>
            <access>read-write</access>
            <resetValue>0x00230601</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>TLCDVERSION</name>
                <description>The current version of NemaDC IP</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CRC</name>
            <description>If CRC errors occur, they are written in the NEMADC_REG_CRC register</description>
            <addressOffset>0x184</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CRC</name>
                <description>CRC value if CRC error exists</description>
                <lsb>0</lsb>
                <msb>31</msb>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FORMATCTRL</name>
            <description>Controls SPI, DBI and MiP-Parallel format.</description>
            <addressOffset>0x1A0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>DBIBCTLB</name>
                <description>When DBI-Type B Interface is selected</description>
                <lsb>0</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>DBIBCTHBMIPVSTOFST</name>
                <description>When DBI-Type B Interface is selected</description>
                <lsb>3</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>DBIBCTLBMIPVSTOFST</name>
                <description>When DBI-Type B Interface is selected</description>
                <lsb>8</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>DBIBCTHBMIPVSTWD</name>
                <description>When DBI-Type B Interface is selected</description>
                <lsb>13</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>SPIRDCYCLESMIPVSTWD</name>
                <description>When SPI Interface is selected</description>
                <lsb>16</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>VSTWIDTHHIGHBITS</name>
                <description>When DBI-Type B or SPI Interfaces is selected</description>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>HSTOFFSET</name>
                <description>When DBI-Type B or SPI Interfaces is selected</description>
                <lsb>23</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>HSTWIDTH</name>
                <description>When DBI-Type B or SPI Interfaces is selected</description>
                <lsb>26</lsb>
                <msb>28</msb>
              </field>
              <field>
                <name>POS29LEN01</name>
                <lsb>29</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>MASKDPIREADYDBIBGE</name>
                <description>When DBI-Type B Interface is selected</description>
                <lsb>30</lsb>
                <msb>30</msb>
              </field>
              <field>
                <name>MUTEDPIDBIBGE</name>
                <description>When DBI-Type B Interface is selected</description>
                <lsb>31</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>FORMATCTRL2</name>
            <description>Controls DBI, SPI and MiP-Parallel format.</description>
            <addressOffset>0x1A4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLNKGXORMIPEN</name>
                <description>When DBI-Type B or SPI Interface is selected</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>BLNKGXORMIPWIDTHLB</name>
                <description>When DBI-Type B or SPI Interface is selected</description>
                <lsb>10</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>MIPWIDTHHB</name>
                <description>When DBI-Type B or SPI Interface is selected</description>
                <lsb>16</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>MIPXRST</name>
                <description>When DBI-Type B or SPI Interface is selected</description>
                <lsb>20</lsb>
                <msb>29</msb>
              </field>
              <field>
                <name>SELDBIBCLK</name>
                <description>Set the exposition of DBIB_CLK based on the following options:</description>
                <lsb>30</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>CLKCTRLCG</name>
            <description>Controls the Clock Gaters and the routing of format and pixel clock</description>
            <addressOffset>0x1A8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLKDIV</name>
                <description>Enable clock divider</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>CLKPOL</name>
                <description>Invert (ouput) clock polarity</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>PIXFORMATCLKSWAP</name>
                <description>Pixel generation and format clock swap</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>POS03LEN14</name>
                <lsb>3</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>PALETTEPIXCG</name>
                <description>Palette pixel clock clock-gater bypass</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>PALETTEBUSCG</name>
                <description>Palette bus clock clock-gater bypass</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>IFFMTCG</name>
                <description>Interfaces format clock clock-gater bypass</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>IFPIXCG</name>
                <description>Interfaces pixel clock clock-gater bypass</description>
                <lsb>20</lsb>
                <msb>20</msb>
              </field>
              <field>
                <name>IFBUSCG</name>
                <description>Interfaces bus clock clock-gater bypass</description>
                <lsb>21</lsb>
                <msb>21</msb>
              </field>
              <field>
                <name>POS22LEN1</name>
                <lsb>22</lsb>
                <msb>22</msb>
              </field>
              <field>
                <name>CGBYPASS</name>
                <description>RegFile clock-gaters bypass</description>
                <lsb>23</lsb>
                <msb>23</msb>
              </field>
              <field>
                <name>LAYER0PIXCG</name>
                <description>layer 0 pixel clock clock-gater bypass</description>
                <lsb>24</lsb>
                <msb>24</msb>
              </field>
              <field>
                <name>LAYER0BUSCG</name>
                <description>layer 0 bus clock clock-gater bypass</description>
                <lsb>25</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>LAYER1PIXCG</name>
                <description>layer 1 pixel clock clock-gater bypass</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>LAYER1BUSCG</name>
                <description>layer 1 bus clock clock-gater bypass</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>LAYER2PIXCG</name>
                <description>layer 2 pixel clock clock-gater bypass</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>LAYER2BUSCG</name>
                <description>layer 2 bus clock clock-gater bypass</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>LAYER3PIXCG</name>
                <description>layer 3 pixel clock clock-gater bypass</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>LAYER3BUSCG</name>
                <description>layer 3 bus clock clock-gater bypass</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FORMATCTRL3</name>
            <description>Control MiP-Parallel format.</description>
            <addressOffset>0x1AC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>XRST</name>
                <description>Set the high state of XRST signal in multiple of VCK</description>
                <lsb>0</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>SPIDBIBCSDELAYASSERT</name>
                <description>For SPI:</description>
                <lsb>10</lsb>
                <msb>12</msb>
              </field>
              <field>
                <name>SPIDBIBCSDELAYDEASSERT</name>
                <description>For SPI:</description>
                <lsb>13</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>HCKBCKMAX</name>
                <description>Inidates the maximum value of HCK/BCK count for MiP-Parallel interface.</description>
                <lsb>16</lsb>
                <msb>25</msb>
              </field>
              <field>
                <name>POS6LEN26</name>
                <lsb>26</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <dim>0x100</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>PALETTE[%s]</name>
            <description>Description collection: Global palette/gamma correction memory region.</description>
            <addressOffset>0x400</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Gamma ramp blue bits.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Gamma ramp green bits.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Gamma ramp red bits.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>POS24LEN08</name>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT00</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT01</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1004</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT02</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT03</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x100C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT04</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1010</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>GAMMALUT05</name>
            <description>Layer 0 palette/gamma correction memory region.</description>
            <addressOffset>0x1014</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>BLUE</name>
                <description>Color blue is used as Lut color.</description>
                <lsb>0</lsb>
                <msb>7</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>GREEN</name>
                <description>Color green is used as Lut color.</description>
                <lsb>8</lsb>
                <msb>15</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>RED</name>
                <description>Color red is used as Lut color.</description>
                <lsb>16</lsb>
                <msb>23</msb>
                <access>write-only</access>
              </field>
              <field>
                <name>ALPHA</name>
                <description>Color alpha is used as Lut color.</description>
                <lsb>24</lsb>
                <msb>31</msb>
                <access>write-only</access>
              </field>
            </fields>
          </register>
