ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
          <register>
            <name>GPUCMDADDRH</name>
            <description>Command List base address High bits</description>
            <addressOffset>0x84C</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CMDADDRH</name>
                <description>Command List address High bits</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUIRQID</name>
            <description>Signals an interrupt when written</description>
            <addressOffset>0xFF0</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>IRQID</name>
                <description>Write any value to signal an interrupt</description>
                <lsb>0</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUGPFLAGS</name>
            <description>Stop/Break the command list when debugging</description>
            <addressOffset>0xFF4</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>LINE0</name>
                <description>GP_FLAG line 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>LINE1</name>
                <description>GP_FLAG line 1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>LINE2</name>
                <description>GP_FLAG line 2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>LINE3</name>
                <description>GP_FLAG line 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>LINEMASK0</name>
                <description>GP_FLAG_mask when set to 1 masks/enables the generation of the output FREEZE signal from line 0</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>LINEMASK1</name>
                <description>GP_FLAG_mask when set to 1 masks/enables the generation of the output FREEZE signal from line 1</description>
                <lsb>5</lsb>
                <msb>5</msb>
              </field>
              <field>
                <name>LINEMASK2</name>
                <description>GP_FLAG_mask when set to 1 masks/enables the generation of the output FREEZE signal from line 2</description>
                <lsb>6</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>LINEMASK3</name>
                <description>GP_FLAG_mask when set to 1 masks/enables the generation of the output FREEZE signal from line 3</description>
                <lsb>7</lsb>
                <msb>7</msb>
              </field>
              <field>
                <name>IRQSYSERRMASK0</name>
                <description>GP_FLAG_irqmask when set to 1 masks/enables the generation of the IRQ_SYSERROR from line 0</description>
                <lsb>8</lsb>
                <msb>8</msb>
              </field>
              <field>
                <name>IRQSYSERRMASK1</name>
                <description>GP_FLAG_irqmask when set to 1 masks/enables the generation of the IRQ_SYSERROR from line 1</description>
                <lsb>9</lsb>
                <msb>9</msb>
              </field>
              <field>
                <name>IRQSYSERRMASK2</name>
                <description>GP_FLAG_irqmask when set to 1 masks/enables the generation of the IRQ_SYSERROR from line 2</description>
                <lsb>10</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>IRQSYSERRMASK3</name>
                <description>GP_FLAG_irqmask when set to 1 masks/enables the generation of the IRQ_SYSERROR from line 3</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>GPUGPFLAGSPOS12LEN04</name>
                <lsb>12</lsb>
                <msb>15</msb>
              </field>
              <field>
                <name>BRK0</name>
                <description>When set to 1, set breakpoint for GP_FLAG line 0 if NEMA_GP_FLAGS[0] bit value is high.</description>
                <lsb>16</lsb>
                <msb>16</msb>
              </field>
              <field>
                <name>BRK1</name>
                <description>When set to 1, set breakpoint for GP_FLAG line 0 if NEMA_GP_FLAGS[1] bit value is high.</description>
                <lsb>17</lsb>
                <msb>17</msb>
              </field>
              <field>
                <name>BRK2</name>
                <description>When set to 1, set breakpoint for GP_FLAG line 0 if NEMA_GP_FLAGS[2] bit value is high.</description>
                <lsb>18</lsb>
                <msb>18</msb>
              </field>
              <field>
                <name>BRK3</name>
                <description>When set to 1, set breakpoint for GP_FLAG line 0 if NEMA_GP_FLAGS[3] bit value is high.</description>
                <lsb>19</lsb>
                <msb>19</msb>
              </field>
              <field>
                <name>GPUGPFLAGSPOS20LEN12</name>
                <lsb>20</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUSYSINTERRUPT</name>
            <description>On Read: Returns the SYSERROR_IRQ ID. On write: Clears the SYSERROR_IRQ.</description>
            <addressOffset>0xFF8</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>ERRORLINE0</name>
                <description>Indicates that IRQ_SYSERROR due to GP_FLAG line 0.</description>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>ERRORLINE1</name>
                <description>Indicates that IRQ_SYSERROR due to GP_FLAG line 1.</description>
                <lsb>1</lsb>
                <msb>1</msb>
              </field>
              <field>
                <name>ERRORLINE2</name>
                <description>Indicates that IRQ_SYSERROR due to GP_FLAG line 2.</description>
                <lsb>2</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>ERRORLINE3</name>
                <description>Indicates that IRQ_SYSERROR due to GP_FLAG line 3.</description>
                <lsb>3</lsb>
                <msb>3</msb>
              </field>
              <field>
                <name>ERRORBUSCODE0</name>
                <description>Indicates the Interface Error Code(AXI only).</description>
                <lsb>4</lsb>
                <msb>4</msb>
              </field>
              <field>
                <name>ERRORBUSCODE1</name>
                <description>Indicates the Bus Error Code occurence direction (AXI only).</description>
                <lsb>5</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>ERRORBUSCODE2</name>
                <description>Indicates the Bus Error Code Interface.</description>
                <lsb>7</lsb>
                <msb>10</msb>
              </field>
              <field>
                <name>ERRORBUSERR</name>
                <description>Indicates that a bus error has occurred.</description>
                <lsb>11</lsb>
                <msb>11</msb>
              </field>
              <field>
                <name>INTERRUPTPOS12LEN20</name>
                <lsb>12</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
          <register>
            <name>GPUBUSERRORMASK</name>
            <description>Sets the mask for the Buserror Interrupt.</description>
            <addressOffset>0xFFC</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>MASK0</name>
                <lsb>0</lsb>
                <msb>0</msb>
              </field>
              <field>
                <name>MASK1</name>
                <description>Sets the mask for the Bus Error Code occurence direction (AXI only).</description>
                <lsb>1</lsb>
                <msb>2</msb>
              </field>
              <field>
                <name>MASK2</name>
                <description>Sets the mask for the Bus Error Code Interface.</description>
                <lsb>3</lsb>
                <msb>6</msb>
              </field>
              <field>
                <name>GPUBUSERRORMASKPOS07LEN24</name>
                <lsb>7</lsb>
                <msb>31</msb>
              </field>
            </fields>
          </register>
        </cluster>
