ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
            <register>
              <name>XIPCTRL</name>
              <description>This Register is valid only when SSIC_CONCURRENT_XIP_EN is equal to 1.</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x08000401</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>FRF</name>
                  <description>SPI Frame Format</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>RSVD</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_DUAL</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_QUAD</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_OCTAL</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TRANSTYPE</name>
                  <description>Address and instruction transfer format.</description>
                  <lsb>2</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TT0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>ADDRL</name>
                  <description>This bit defines Length of Address to be transmitted.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ADDR_L0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L12</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L16</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L20</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L24</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L28</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L32</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L36</name>
                      <description>Unspecified</description>
                      <value>0x9</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L40</name>
                      <description>Unspecified</description>
                      <value>0xA</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L44</name>
                      <description>Unspecified</description>
                      <value>0xB</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L48</name>
                      <description>Unspecified</description>
                      <value>0xC</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L52</name>
                      <description>Unspecified</description>
                      <value>0xD</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L56</name>
                      <description>Unspecified</description>
                      <value>0xE</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L60</name>
                      <description>Unspecified</description>
                      <value>0xF</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>INSTL</name>
                  <description>Dual/Quad/Octal mode instruction length in bits.</description>
                  <lsb>9</lsb>
                  <msb>10</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INST_L0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L16</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MDBITSEN</name>
                  <description>Mode bits enable in XIP mode.</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                </field>
                <field>
                  <name>WAITCYCLES</name>
                  <description>Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception.</description>
                  <lsb>13</lsb>
                  <msb>17</msb>
                </field>
                <field>
                  <name>DFSHC</name>
                  <description>Fix DFS for XIP transfers.</description>
                  <lsb>18</lsb>
                  <msb>18</msb>
                </field>
                <field>
                  <name>DDREN</name>
                  <description>SPI DDR Enable bit.</description>
                  <lsb>19</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>INSTDDREN</name>
                  <description>Instruction DDR Enable bit.</description>
                  <lsb>20</lsb>
                  <msb>20</msb>
                </field>
                <field>
                  <name>RXDSEN</name>
                  <description>Read data strobe enable bit.</description>
                  <lsb>21</lsb>
                  <msb>21</msb>
                </field>
                <field>
                  <name>INSTEN</name>
                  <description>XIP instruction enable bit.</description>
                  <lsb>22</lsb>
                  <msb>22</msb>
                </field>
                <field>
                  <name>CONTXFEREN</name>
                  <description>Enable continuous transfer in XIP mode.</description>
                  <lsb>23</lsb>
                  <msb>23</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPHYPERBUSEN</name>
                  <description>SPI Hyperbus Frame format enable for XIP transfers.</description>
                  <lsb>24</lsb>
                  <msb>24</msb>
                </field>
                <field>
                  <name>RXDSSIGEN</name>
                  <description>Enable rxds signaling during address and command phase of Hyperbus transfer.</description>
                  <lsb>25</lsb>
                  <msb>25</msb>
                </field>
                <field>
                  <name>XIPMBL</name>
                  <description>XIP Mode bits length.</description>
                  <lsb>26</lsb>
                  <msb>27</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>MBL_2</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>MBL_16</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>XIPPREFETCHEN</name>
                  <description>Enables XIP pre-fetch functionality in DWC_ssi.</description>
                  <lsb>29</lsb>
                  <msb>29</msb>
                </field>
              </fields>
            </register>
            <register>
              <name>XRXOICR</name>
              <description>XIP Receive FIFO Overflow Interrupt Clear Register</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>XRXOICR</name>
                  <description>Clear XIP Receive FIFO Overflow Interrupt.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>XIPWRITEINCRINST</name>
              <description>This Register is valid only when both SSIC_XIP_WRITE_REG_EN is set to 1.</description>
              <addressOffset>0x040</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>INCRWRITEINST</name>
                  <description>XIP Write INCR transfer opcode.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>RSVDINCRINST16TO31</name>
                  <description>Reserved bits - Read Only</description>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>XIPWRITEWRAPINST</name>
              <description>This Register is valid only when both SSIC_XIP_WRITE_REG_EN is set to 1.</description>
              <addressOffset>0x044</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>WRAPWRITEINST</name>
                  <description>XIP Write WRAP transfer opcode.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>RSVDWRAPINST16TO31</name>
                  <description>Reserved bits - Read Only</description>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>XIPWRITECTRL</name>
              <description>This Register is valid only when SSIC_XIP_WRITE_REG_EN is equal to 1.</description>
              <addressOffset>0x048</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>WRFRF</name>
                  <description>SPI Frame Format</description>
                  <lsb>0</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>RSVD</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_DUAL</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_QUAD</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SPI_OCTAL</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRTRANSTYPE</name>
                  <description>Address and instruction transfer format.</description>
                  <lsb>2</lsb>
                  <msb>3</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>TT0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT1</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT2</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TT3</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRADDRL</name>
                  <description>This bit defines Length of Address to be transmitted.</description>
                  <lsb>4</lsb>
                  <msb>7</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>ADDR_L0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L12</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L16</name>
                      <description>Unspecified</description>
                      <value>0x4</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L20</name>
                      <description>Unspecified</description>
                      <value>0x5</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L24</name>
                      <description>Unspecified</description>
                      <value>0x6</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L28</name>
                      <description>Unspecified</description>
                      <value>0x7</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ADDR_L32</name>
                      <description>Unspecified</description>
                      <value>0x8</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRINSTL</name>
                  <description>Dual/Quad/Octal mode instruction length in bits.</description>
                  <lsb>8</lsb>
                  <msb>9</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INST_L0</name>
                      <description>Unspecified</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L4</name>
                      <description>Unspecified</description>
                      <value>0x1</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L8</name>
                      <description>Unspecified</description>
                      <value>0x2</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>INST_L16</name>
                      <description>Unspecified</description>
                      <value>0x3</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>WRSPIDDREN</name>
                  <description>SPI DDR Enable bit.</description>
                  <lsb>10</lsb>
                  <msb>10</msb>
                </field>
                <field>
                  <name>WRINSTDDREN</name>
                  <description>Instruction DDR Enable bit.</description>
                  <lsb>11</lsb>
                  <msb>11</msb>
                </field>
                <field>
                  <name>XIPWRHYPERBUSEN</name>
                  <description>SPI Hyperbus Frame format enable for XIP Write transfers.</description>
                  <lsb>12</lsb>
                  <msb>12</msb>
                </field>
                <field>
                  <name>XIPWRRXDSSIGEN</name>
                  <description>Enable rxds signaling during address and command phase of Hyperbus transfer.</description>
                  <lsb>13</lsb>
                  <msb>13</msb>
                </field>
                <field>
                  <name>RSVDXIPWRITECTRL14TO15</name>
                  <description>Reserved bits - Read Only</description>
                  <lsb>14</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>XIPWRWAITCYCLES</name>
                  <description>Wait cycles in Dual/Quad/Octal mode between control frames transmit and data reception.</description>
                  <lsb>16</lsb>
                  <msb>20</msb>
                </field>
                <field>
                  <name>RSVDXIPWRITECTRL21TO31</name>
                  <description>Reserved bits - Read Only</description>
                  <lsb>21</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
          </cluster>
        </cluster>
