ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_IPCT120_NS">
      <name>GLOBAL_IPCT120_S</name>
      <description>IPCT APB registers 1</description>
      <baseAddress>0x5F8D1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
      <interrupt>
        <name>IPCT120_0</name>
        <value>209</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_MUTEX120_NS</name>
      <description>MUTEX 0</description>
      <baseAddress>0x4F8D2000</baseAddress>
      <headerStructName>MUTEX</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>MUTEX</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <dim>0x20</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>MUTEX[%s]</name>
          <description>Description collection: Mutex register</description>
          <addressOffset>0x400</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MUTEX</name>
              <description>Mutex register n</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <enumeratedValues>
                <enumeratedValue>
                  <name>Unlocked</name>
                  <description>Mutex n is in unlocked state</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Locked</name>
                  <description>Mutex n is in locked state</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GLOBAL_PROTOTYPE_NS</name>
      <description>Prototype HW information registers.</description>
      <baseAddress>0x4F8D2000</baseAddress>
      <alternatePeripheral>GLOBAL_MUTEX120_NS</alternatePeripheral>
      <headerStructName>PROTOTYPEINFO</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=NS-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>PROTOTYPEINFO</groupName>
      <size>0x20</size>
      <registers>
        <register>
          <name>PSPHWID</name>
          <description>PSP hardware ID register, unique ID for each prototype release. Used to identify RTL release that prototype is based on.</description>
          <addressOffset>0x800</addressOffset>
          <access>read-only</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>PATCHRELEASEVERSION</name>
              <description>PSP patch/bugfix release version</description>
              <lsb>0</lsb>
              <msb>7</msb>
            </field>
            <field>
              <name>HOTFIXRELEASEVERSION</name>
              <description>hotfix release version</description>
              <lsb>8</lsb>
              <msb>15</msb>
            </field>
            <field>
              <name>RTLRELEASEVERSION</name>
              <description>First letter of RTL release version in ASCII corresponding to A-Z.</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
            <field>
              <name>PRODUCTCONFIG</name>
              <description>Product Config</description>
              <lsb>24</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FPGATIMESTAMP</name>
          <description>32-bit timestamp value stored by the FPGA bitstream in format ddddd_MMMM_yyyyyy_hhhhh_mmmmmm_ssssss. Unique for every FPGA netlist implementation, not dependent to RTL synthesis.  0x87654321 set in emulator database.</description>
          <addressOffset>0x804</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FPGATIMESTAMP</name>
              <description>ddddd = 5 bits to represent 31 days in a month. MMMM = 4 bits to represent 12 months in a year. yyyyyy = 6 bits to represent 0 to 63 (to note year 2000 to 2063). hhhhh = 5 bits to represent 24 hours in a day. mmmmmm = 6 bits to represent 60 minutes in an hour. ssssss = 6 bits to represent 60 seconds in a minute.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>EMULATORSPEEDVALUE</name>
          <description>Used to store real speed of emulator is running. Used by SW to config UART speed etc, to ensure correct operation.</description>
          <addressOffset>0x808</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>EMULATORSPEEDVALUE</name>
              <description>Actual clock speed for FCLK 400M in emulator (Hz). In FPGA set to 0x0.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
        <register>
          <name>FPGACLOCKDIVIDERRATIO</name>
          <description>Overall clock divider ratio for FPGA</description>
          <addressOffset>0x80C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>FPGACLOCKDIVIDERRATIO</name>
              <description>Overall clock divider ratio for FPGA. Set to 0 for emulator database.</description>
              <lsb>0</lsb>
              <msb>31</msb>
            </field>
          </fields>
        </register>
