ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
                  </enumeratedValues>
                </field>
              </fields>
            </register>
            <register>
              <name>CTRLR1</name>
              <description>Control Register 1</description>
              <addressOffset>0x004</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>NDF</name>
                  <description>Number of Data Frames.</description>
                  <lsb>0</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>RSVDCTRLR1</name>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SSIENR</name>
              <description>SSI Enable Register</description>
              <addressOffset>0x008</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SSICEN</name>
                  <description>SSI Enable.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>Disables QSPI CORE</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>Enables QSPI CORE</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSSIENR</name>
                  <lsb>1</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>MWCR</name>
              <description>Microwire Control Register</description>
              <addressOffset>0x00C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>MWMOD</name>
                  <description>Microwire Transfer Mode.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NONSEQUENTIAL</name>
                      <description>Non-Sequential Transfer</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>SEQUENTIAL</name>
                      <description>Sequential Transfer</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MDD</name>
                  <description>Microwire Control.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>RECEIVE</name>
                      <description>SSI receives data</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TRANSMIT</name>
                      <description>SSI transmits data</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>MHS</name>
                  <description>Microwire Handshaking.</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>DISABLE</name>
                      <description>handshaking interface is disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ENABLED</name>
                      <description>handshaking interface is enabled</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDMWCR</name>
                  <lsb>3</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SER</name>
              <description>Target Enable Register</description>
              <addressOffset>0x010</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>SER</name>
                  <description>Chip Select Enable Flag.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>RSVDSER</name>
                  <lsb>4</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>BAUDR</name>
              <description>Baud Rate Select</description>
              <addressOffset>0x014</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000002</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RSVDBAUDR0</name>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>SCKDV</name>
                  <description>SSI Clock Divider.</description>
                  <lsb>1</lsb>
                  <msb>15</msb>
                </field>
                <field>
                  <name>RSVDBAUDR1631</name>
                  <lsb>16</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TXFTLR</name>
              <description>Transmit FIFO Threshold Level</description>
              <addressOffset>0x018</addressOffset>
              <access>read-write</access>
              <resetValue>0x00080000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TFT</name>
                  <description>Transmit FIFO Threshold.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>RSVDTXFTLR</name>
                  <lsb>4</lsb>
                  <msb>15</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>TXFTHR</name>
                  <description>Transfer start FIFO level.</description>
                  <lsb>16</lsb>
                  <msb>19</msb>
                </field>
                <field>
                  <name>RSVDTXFTHR</name>
                  <lsb>20</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RXFTLR</name>
              <description>Receive FIFO Threshold Level</description>
              <addressOffset>0x01C</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RFT</name>
                  <description>Receive FIFO Threshold.</description>
                  <lsb>0</lsb>
                  <msb>3</msb>
                </field>
                <field>
                  <name>RSVDRXFTLR</name>
                  <lsb>4</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>TXFLR</name>
              <description>Transmit FIFO Level Register</description>
              <addressOffset>0x020</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>TXTFL</name>
                  <description>Transmit FIFO Level.</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDTXFLR</name>
                  <lsb>5</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>RXFLR</name>
              <description>Receive FIFO Level Register</description>
              <addressOffset>0x024</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000000</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>RXTFL</name>
                  <description>Receive FIFO Level.</description>
                  <lsb>0</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>RSVDRXFLR</name>
                  <lsb>5</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
            <register>
              <name>SR</name>
              <description>Status Register</description>
              <addressOffset>0x028</addressOffset>
              <access>read-write</access>
              <resetValue>0x00000006</resetValue>
              <size>0x20</size>
              <fields>
                <field>
                  <name>BUSY</name>
                  <description>SSI Busy Flag.</description>
                  <lsb>0</lsb>
                  <msb>0</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>INACTIVE</name>
                      <description>QSPI CORE is idle or disabled</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>ACTIVE</name>
                      <description>QSPI CORE is actively transferring data</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TFNF</name>
                  <description>Transmit FIFO Not Full.</description>
                  <lsb>1</lsb>
                  <msb>1</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>FULL</name>
                      <description>Tx FIFO is full</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NOTFULL</name>
                      <description>Tx FIFO is not Full</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TFE</name>
                  <description>Transmit FIFO Empty.</description>
                  <lsb>2</lsb>
                  <msb>2</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOTEMPTY</name>
                      <description>Transmit FIFO is not empty</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>EMPTY</name>
                      <description>Transmit FIFO is empty</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RFNE</name>
                  <description>Receive FIFO Not Empty.</description>
                  <lsb>3</lsb>
                  <msb>3</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>EMPTY</name>
                      <description>Receive FIFO is empty</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>NOTEMPTY</name>
                      <description>Receive FIFO is not empty</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RFF</name>
                  <description>Receive FIFO Full.</description>
                  <lsb>4</lsb>
                  <msb>4</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOTFULL</name>
                      <description>Receive FIFO is not full</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>FULL</name>
                      <description>Receive FIFO is full</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>TXE</name>
                  <description>Transmission Error.</description>
                  <lsb>5</lsb>
                  <msb>5</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOERROR</name>
                      <description>No Error</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TXERROR</name>
                      <description>Transmission Error</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>DCOL</name>
                  <description>Data Collision Error.</description>
                  <lsb>6</lsb>
                  <msb>6</msb>
                  <access>read-only</access>
                  <enumeratedValues>
                    <enumeratedValue>
                      <name>NOERRORCONDITION</name>
                      <description>No Error</description>
                      <value>0x0</value>
                    </enumeratedValue>
                    <enumeratedValue>
                      <name>TXCOLLISIONERROR</name>
                      <description>Transmit Data Collision Error</description>
                      <value>0x1</value>
                    </enumeratedValue>
                  </enumeratedValues>
                </field>
                <field>
                  <name>RSVDSR</name>
                  <lsb>7</lsb>
                  <msb>14</msb>
                  <access>read-only</access>
                </field>
                <field>
                  <name>CMPLTDDF</name>
                  <description>Completed Data frames</description>
                  <lsb>15</lsb>
                  <msb>31</msb>
                  <access>read-only</access>
                </field>
              </fields>
            </register>
