ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_RTC130_NS">
      <name>GLOBAL_RTC130_S</name>
      <description>Real-time counter 1</description>
      <baseAddress>0x5F928000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>RTC130</name>
        <value>296</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_RTC130_NS">
      <name>GLOBAL_RTC131_NS</name>
      <description>Real-time counter 2</description>
      <baseAddress>0x4F929000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>RTC131</name>
        <value>297</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_RTC130_NS">
      <name>GLOBAL_RTC131_S</name>
      <description>Real-time counter 3</description>
      <baseAddress>0x5F929000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>RTC131</name>
        <value>297</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>GLOBAL_WDT131_NS</name>
      <description>Watchdog Timer 4</description>
      <baseAddress>0x4F92B000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT131</name>
        <value>299</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>GLOBAL_WDT131_S</name>
      <description>Watchdog Timer 5</description>
      <baseAddress>0x5F92B000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT131</name>
        <value>299</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>GLOBAL_WDT132_NS</name>
      <description>Watchdog Timer 6</description>
      <baseAddress>0x4F92C000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT132</name>
        <value>300</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="WDT010_NS">
      <name>GLOBAL_WDT132_S</name>
      <description>Watchdog Timer 7</description>
      <baseAddress>0x5F92C000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>WDT132</name>
        <value>300</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU020_NS">
      <name>GLOBAL_EGU130_NS</name>
      <description>Event generator unit 2</description>
      <baseAddress>0x4F92D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU130</name>
        <value>301</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="EGU020_NS">
      <name>GLOBAL_EGU130_S</name>
      <description>Event generator unit 3</description>
      <baseAddress>0x5F92D000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>EGU130</name>
        <value>301</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>GLOBAL_COEXC_NS</name>
      <description>Coexistence controller 0</description>
      <baseAddress>0x4F92E000</baseAddress>
      <headerStructName>COEXC</headerStructName>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <!--Split access-->
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <groupName>COEXC</groupName>
      <size>0x20</size>
      <registers>
        <cluster>
          <dim>6</dim>
          <dimIncrement>0x020</dimIncrement>
          <name>CCMALLOW[%s]</name>
          <description>Unspecified</description>
          <headerStructName>GLOBAL_COEXC_CCMALLOW</headerStructName>
          <access>read-write</access>
          <addressOffset>0x400</addressOffset>
          <register>
            <dim>0x8</dim>
            <dimIncrement>0x4</dimIncrement>
            <name>MODE[%s]</name>
            <description>Description collection: Coexistence client mode allow configuration for mode [o] in client [n]</description>
            <addressOffset>0x000</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <size>0x20</size>
            <fields>
              <field>
                <name>CLIENT_0_MODE_0</name>
                <description>Coexistence allowed configuration for mode [0] in client [0]</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_0_MODE_1</name>
                <description>Coexistence allowed configuration for mode [1] in client [0]</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_0_MODE_2</name>
                <description>Coexistence allowed configuration for mode [2] in client [0]</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_0_MODE_3</name>
                <description>Coexistence allowed configuration for mode [3] in client [0]</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_1_MODE_0</name>
                <description>Coexistence allowed configuration for mode [0] in client [1]</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_1_MODE_1</name>
                <description>Coexistence allowed configuration for mode [1] in client [1]</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_1_MODE_2</name>
                <description>Coexistence allowed configuration for mode [2] in client [1]</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_1_MODE_3</name>
                <description>Coexistence allowed configuration for mode [3] in client [1]</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_2_MODE_0</name>
                <description>Coexistence allowed configuration for mode [0] in client [2]</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_2_MODE_1</name>
                <description>Coexistence allowed configuration for mode [1] in client [2]</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_2_MODE_2</name>
                <description>Coexistence allowed configuration for mode [2] in client [2]</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_2_MODE_3</name>
                <description>Coexistence allowed configuration for mode [3] in client [2]</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_3_MODE_0</name>
                <description>Coexistence allowed configuration for mode [0] in client [3]</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_3_MODE_1</name>
                <description>Coexistence allowed configuration for mode [1] in client [3]</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_3_MODE_2</name>
                <description>Coexistence allowed configuration for mode [2] in client [3]</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_3_MODE_3</name>
                <description>Coexistence allowed configuration for mode [3] in client [3]</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_4_MODE_0</name>
                <description>Coexistence allowed configuration for mode [0] in client [4]</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_4_MODE_1</name>
                <description>Coexistence allowed configuration for mode [1] in client [4]</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_4_MODE_2</name>
                <description>Coexistence allowed configuration for mode [2] in client [4]</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_4_MODE_3</name>
                <description>Coexistence allowed configuration for mode [3] in client [4]</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_5_MODE_0</name>
                <description>Coexistence allowed configuration for mode [0] in client [5]</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_5_MODE_1</name>
                <description>Coexistence allowed configuration for mode [1] in client [5]</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_5_MODE_2</name>
                <description>Coexistence allowed configuration for mode [2] in client [5]</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>CLIENT_5_MODE_3</name>
                <description>Coexistence allowed configuration for mode [3] in client [5]</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>NotAllowed</name>
                    <description>Coexistence not allowed</description>
                    <value>0x0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Allow</name>
                    <description>Coexistence allowed</description>
                    <value>0x1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>0x6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCCONF[%s]</name>
          <description>Description collection: Configuration of coexistence client [n]</description>
          <addressOffset>0x600</addressOffset>
          <access>read-write</access>
          <resetValue>0x00080000</resetValue>
          <size>0x20</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Coexistence mode of the client [m]</description>
              <lsb>0</lsb>
              <msb>2</msb>
            </field>
            <field>
              <name>PRIORITY</name>
              <description>Priority of the coexistence client [n]</description>
              <lsb>16</lsb>
              <msb>23</msb>
            </field>
          </fields>
        </register>
