ankuns/nrfx/bsp/stable/mdk/nrf7140_radiocore.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PDM130_NS">
      <name>GLOBAL_PDM130_S</name>
      <description>Pulse Density Modulation (Digital Microphone) Interface 1</description>
      <baseAddress>0x5F9A7000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PDM130</name>
        <value>423</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="DPPIC020_NS">
      <name>GLOBAL_DPPIC134_NS</name>
      <description>Distributed programmable peripheral interconnect controller 14</description>
      <baseAddress>0x4F9B1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="DPPIC020_NS">
      <name>GLOBAL_DPPIC134_S</name>
      <description>Distributed programmable peripheral interconnect controller 15</description>
      <baseAddress>0x5F9B1000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=S-->
      <!--Split access-->
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER132_NS</name>
      <description>Timer/Counter 14</description>
      <baseAddress>0x4F9B2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER132</name>
        <value>434</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER132_S</name>
      <description>Timer/Counter 15</description>
      <baseAddress>0x5F9B2000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER132</name>
        <value>434</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER133_NS</name>
      <description>Timer/Counter 16</description>
      <baseAddress>0x4F9B3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER133</name>
        <value>435</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="TIMER020_NS">
      <name>GLOBAL_TIMER133_S</name>
      <description>Timer/Counter 17</description>
      <baseAddress>0x5F9B3000</baseAddress>
      <!--Security dma=NA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>TIMER133</name>
        <value>435</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM131_NS</name>
      <description>Pulse width modulation unit 4</description>
      <baseAddress>0x4F9B4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM131</name>
        <value>436</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_PWM120_NS">
      <name>GLOBAL_PWM131_S</name>
      <description>Pulse width modulation unit 5</description>
      <baseAddress>0x5F9B4000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>PWM131</name>
        <value>436</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM132_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 12</description>
      <baseAddress>0x4F9B5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS132_NS</name>
      <description>SPI Slave 6</description>
      <baseAddress>0x4F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM132_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 4</description>
      <baseAddress>0x4F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS132_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 4</description>
      <baseAddress>0x4F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE132_NS</name>
      <description>UART with EasyDMA 6</description>
      <baseAddress>0x4F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM132_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 13</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS132_S</name>
      <description>SPI Slave 7</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM132_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 5</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS132_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 5</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE132_S</name>
      <description>UART with EasyDMA 7</description>
      <baseAddress>0x5F9B5000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM132_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL2</name>
        <value>437</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM133_NS</name>
      <description>Serial Peripheral Interface Master with EasyDMA 14</description>
      <baseAddress>0x4F9B6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS133_NS</name>
      <description>SPI Slave 8</description>
      <baseAddress>0x4F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM133_NS</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 6</description>
      <baseAddress>0x4F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS133_NS</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 6</description>
      <baseAddress>0x4F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE133_NS</name>
      <description>UART with EasyDMA 8</description>
      <baseAddress>0x4F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133_NS</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIM120_NS">
      <name>GLOBAL_SPIM133_S</name>
      <description>Serial Peripheral Interface Master with EasyDMA 15</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_SPIS120_NS">
      <name>GLOBAL_SPIS133_S</name>
      <description>SPI Slave 9</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIM130_NS">
      <name>GLOBAL_TWIM133_S</name>
      <description>I2C compatible Two-Wire Master Interface with EasyDMA 7</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_TWIS130_NS">
      <name>GLOBAL_TWIS133_S</name>
      <description>I2C compatible Two-Wire Slave Interface with EasyDMA 7</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GLOBAL_UARTE120_NS">
      <name>GLOBAL_UARTE133_S</name>
      <description>UART with EasyDMA 9</description>
      <baseAddress>0x5F9B6000</baseAddress>
      <alternatePeripheral>GLOBAL_SPIM133_S</alternatePeripheral>
      <!--Security dma=SA-->
      <!--Security securemapping=US-->
      <interrupt>
        <name>SERIAL3</name>
        <value>438</value>
      </interrupt>
    </peripheral>
